[
{"url": "https://timesofindia.indiatimes.com/business/india-business/bank-holiday-today-are-banks-closed-this-weekend-check-state-wise-list/articleshow/124178115.cms", "headline": "Bank holiday today: Are banks closed this weekend? Check state-wise list", "content": "Trending / TIMESOFINDIA.COM / Banks across India, including major lenders like the State Bank of India (SBI), will observe holidays this weekend as per the (RBI) calendar. Regular RBI holidays include all Sundays, as well as the second and fourth Saturdays of each month. Pan-India closures for the fourth Saturday and Sunday. RBI-mandated holiday in Agartala, Kolkata, and Guwahati for Maha Saptami, the seventh day of Durga Puja. Banks in Agartala, Bhubaneswar, Guwahati, Imphal, Jaipur, Kolkata, Patna, and Ranchi will remain closed on Maha Ashtami/Durga Ashtami. Not all branches will be closed on every date, as holidays can vary by state. Customers are advised to check with their local branch before planning visits. Even when branches are shut, banking services remain accessible online. Customers can use ATMs, mobile apps, internet banking, and digital payment platforms for fund transfers, bill payments, deposits, and loan applications. However, services requiring in-person visits—such as bulk cash deposits, demand drafts, or account settlements—will not be available on these days. Residents and businesses are encouraged to plan transactions in advance to avoid inconvenience. Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment Lifestyle Entertainment", "summary": "India Business News: Bank holiday today: Banks across India, including major lenders like the State Bank of India (SBI), will observe holidays this weekend as per the Rese.", "author": "TOI Business Desk", "date_published": "Sep 27, 2025, 13:32 IST", "keywords": "bank holiday,RBI calendar,online banking,ATMs,bank closures,State Bank of India (SBI),Reserve Bank of India,maha saptami", "image_url": "https://static.toiimg.com/thumb/msid-124179135,imgsize-24918,width-400,resizemode-4/.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:06:55.477751", "word_count": 187, "read_time": 1, "date_machine": "Sep 27, 2025, 13:32 IST", "tags": ["bank holiday", "RBI calendar", "online banking", "ATMs", "bank closures", "State Bank of India (SBI)", "Reserve Bank of India", "maha saptami"]},
{"url": "https://timesofindia.indiatimes.com/business/financial-literacy/taxation/income-tax-return-filing-how-new-ais-correction-status-update-feature-will-help-taxpayers-explained/articleshow/110152813.cms", "headline": "Income Tax Return Filing: How new AIS correction status update feature will help taxpayers - explained", "content": "Trending This story is from May 15, 2024 / TIMESOFINDIA.COM / The Central Board of Direct Taxes (CBDT) revamped the AIS system, enabling real-time tracking of correction requests for taxpayers. The AIS, accessible via the compliance portal on the e-filing ITR portal at incometax.gov.in, includes a feature to show feedback status. Return e-filing: Taxpayers facing inaccuracies in their Annual Information Statement (AIS) now have a solution at hand. The Central Board of Direct Taxes (CBDT) has revamped the AIS system, enabling individuals to track the status of their correction requests in real-time. The CBDT announced in a press release dated May 13, 2024, that they've added a new feature to the AIS. This feature will show if the taxpayer's feedback has been addressed by the source, either partially or fully, by accepting or rejecting it. As per an ET report, the AIS can be found on the compliance portal, which is accessible to all registered income taxpayers. You can't access the compliance portal directly. First, you need to log in to the e-filing ITR portal, then go to the 'Pending Actions' tab to access the compliance portal. CBDT stated in its press release that the Annual Information Statement is accessible to all registered Income Taxpayers via the compliance portal, which can be reached through the e-filing website (incometax.gov.in). According to the CBDT's press release, if the feedback is partially or fully accepted, the source needs to correct the information by filing a correction statement. The AIS will display the following details regarding feedback confirmation from the source: - Confirmation Status: Indicates if feedback has been shared with the reporting source. - Date of Feedback Sharing: Shows when feedback was sent to the reporting source. - Date of Source Response: Displays when the reporting source responded to the feedback. - Source Response: Indicates the response provided by the source based on the taxpayer's feedback (whether correction is needed or not). CBDT mentioned in the press release that this new feature is anticipated to enhance transparency by showing such information in AIS to the taxpayer. If there's incorrect AIS data, you need to give feedback for correction. But in the past, there have been issues when the reporting source didn't act promptly to fix this. As a result, taxpayers got income tax intimation notices because of discrepancies between AIS and ITR data. Mihir Tanna, an associate director-direct tax at S.K Patodia LLP, a CA firm, states that they have observed how incorrect information in AIS has caused distress to numerous legitimate taxpayers upon receiving intimation from the regarding data mismatches between AIS and filed ITR. In the past, some of their clients encountered issues where sale and purchase transactions of shares appeared in AIS, despite not being conducted by them. They provided feedback in the AIS tab but were uncertain if the reporting entity took necessary action. This new feature will make it clear if you need to do anything more after providing feedback on wrong AIS information. According to Tanna, if the reporting source doesn't accept the feedback, then the taxpayer only needs to take necessary action. This clarity and transparency are provided by the new functionality. Experts note that the CBDT's press release doesn't specify how the taxpayer will be informed about the feedback provided by the reporting source. Divya Jokhakar, a CA and Associate of the Association of Chartered Certified Accountants (ACCA) in the United Kingdom (UK), explains that the new feature will now notify the taxpayer after they provide feedback on incorrect AIS data, including the date when the reporting source is informed and confirmation is sent. Similarly, the taxpayer will also be notified about the response and its date from the source. The press release doesn't mention how this communication will happen, but it's likely to be through SMS to the registered mobile number and email to the registered email ID. Experts also mention that the communication between the taxpayer and reporting source becomes simpler. According to Jokhakar, this change means that communication is no longer one-sided as it was before. This should provide taxpayers with some relief, knowing that their feedback is being addressed. Additionally, they can interact with sources like tax deductors , collectors, and SFT filers more easily. The AIS gathers financial data from various sources known as reporting entities. This data offers a snapshot of the taxpayer's financial transactions, forming the basis for filing income tax returns. Yet, since this information comes from third-party reports, there's a possibility of errors entering the AIS database due to reporting mistakes. To address this issue, CBDT implemented a feedback system within AIS. CBDT stated in the press release that within AIS, taxpayers can now give feedback on each displayed transaction. This feedback allows taxpayers to comment on the accuracy of the information provided by the source. If there's incorrect reporting, the system automatically follows up with the source for confirmation. Currently, this confirmation process is operational for information provided by Tax Deductors/Collectors and Reporting Entities. With the recent update, the feedback system has become more responsive, giving taxpayers the ability to take corrective actions and track the status of correction requests. business business business business business business business business business business", "summary": "Financial Literacy News: Taxpayers facing inaccuracies in their Annual Information Statement (AIS) now have a solution at hand. The Central Board of Direct Taxes (CBDT) has revamped the AIS system, enabling individuals to track the status of their correction requests in real-time.", "author": "TOI Business Desk", "date_published": "May 15, 2024, 18:51 IST", "keywords": "taxpayers,tax implications,tax deductors,information confirmation process,income tax rebate,income tax department,income tax,financial data,Central Board of Direct Taxes,Annual Information Statement", "image_url": "https://static.toiimg.com/thumb/msid-110152827,imgsize-27984,width-400,resizemode-4/110152827.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:06:56.949219", "word_count": 865, "read_time": 4, "date_machine": "May 15, 2024, 18:51 IST", "tags": ["taxpayers", "tax implications", "tax deductors", "information confirmation process", "income tax rebate", "income tax department", "income tax", "financial data", "Central Board of Direct Taxes", "Annual Information Statement"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/new-income-tax-bill-2025-for-common-man-better-understanding-of-law-and-smoother-tax-compliances-expected/articleshow/118377911.cms", "headline": "New Income Tax Bill 2025: For common man, better understanding of law and smoother tax compliances expected", "content": "Trending / TIMESOFINDIA.COM / New Income Tax Bill 2025: The language used in the Bill at many places is extremely lucid and is reader friendly as it has tables and formulas as against the traditional verbose style. New Income Tax Bill 2025 : Representing a historic milestone in India’s tax landscape, Hon. Finance Minister – Madam has presented the Income Tax Bill, 2025 (Bill) in the Parliament on 13 February 2025. The current Income tax law - Income Tax Act, 1961 (the current Act) was enacted more than six decades ago. With passage of time there were multiple amendments made to the law. Many believed this resulted in the current Act becoming difficult to read, complex to interpret and resulted in unwarranted litigation as well. Hence, it was indeed an opportune time to embark on an exercise to simplify the same. While an attempt was made to this effect a decade ago with the draft Direct Tax Code (DTC) – it never became legislation. Globally as well, countries like the UK, Australia etc., had undertaken similar exercises to enhance clarity and compliance in their taxation laws. Hence, a new simplified income tax law in India was definitely the need of the hour. Also Read | The Bill is prepared by investing more than 60,000 man-hours and has 23 chapters and 2.6 lakh words in comparison to 46 chapters and 5.12 lakh words respectively when compared with the Current Act. The number of Sections has also dramatically reduced from 800 plus sections to 536 Sections only. Secondly the language used in the Bill at many places is extremely lucid and is reader friendly as it has tables and formulas as against the traditional verbose style. One of the most significant aspects of the Bill is the elimination of the concepts of ‘previous year’ and ‘assessment year’. India is trying to join the league of comparable tax jurisdictions by using one single term ‘tax year’. The current terms of previous year and assessment year was apparently leading to mistakes by taxpayers while filing forms/ challans etc. With now only one term “tax year” it will hopefully avoid confusion. Largely, there are no changes to the definition of residency or even salary related provisions for that matter. In fact the choice of the two tax regimes continues to be available to individual taxpayers. There is no change to the tax rates and capital gains tax regime also remains the same. Also Read | TDS and TCS provisions have been made easier to comprehend by providing tables instead of the existing provisions which have lengthy texts that are open to interpretation issues and quite often difficult to understand. The Bill now also gives the ability for individuals to apply for a Lower or NIL rate of TCS while they purchase a car, pay for foreign tour, or make remittance abroad under the Liberalised Remittance Scheme (LRS) of the Reserve Bank of India. It is also interesting to note that elaborate provisions have been enunciated for dealing with transition from the current Act to the new law. There is a clear focus on encouragement of compliance with the mantra of “Trust first, scrutinize later” – as stated by Hon. FM in her recent Feb 2025 Budget speech. As and when the Bill is enacted, the administrative measures for implementing them will be made operational (e.g., publishing of rules, IT infrastructure revamp etc.), keeping in mind the convenience of taxpayers and all stakeholders. For the common man, it is anticipated that the Bill will help in easy understanding of law and smoother tax compliances. Food travel Lifestyle Lifestyle Lifestyle Lifestyle Entertainment Food Lifestyle", "summary": "India Business News: New Income Tax Bill 2025: The language used in the Bill at many places is extremely lucid and is reader friendly as it has tables and formulas as agai", "author": "TOI Business Experts", "date_published": "Feb 19, 2025, 11:39 IST", "keywords": "Business news,simplified tax law,Nirmala Sitharaman,New Income Tax Bill 2025,Income Tax Bill 2025,Income Tax Act 1961", "image_url": "https://static.toiimg.com/thumb/msid-118378085,imgsize-59204,width-400,resizemode-4/118378085.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:06:58.307363", "word_count": 607, "read_time": 3, "date_machine": "Feb 19, 2025, 11:39 IST", "tags": ["Business news", "simplified tax law", "Nirmala Sitharaman", "New Income Tax Bill 2025", "Income Tax Bill 2025", "Income Tax Act 1961"]},
{"url": "https://timesofindia.indiatimes.com/business/international-business/golden-visa-programmes-for-indians-what-is-golden-visa-and-what-is-the-minimum-capital-required-to-get-it-in-various-countries-check-list/articleshow/118820974.cms", "headline": "Golden visa programmes for Indians: What is golden visa and what is the minimum capital required to get it in various countries? Check list", "content": "Trending / TIMESOFINDIA.COM / Countries are tightening immigration rules while offering investment-based residency through golden visa programmes. These visas provide affluent individuals residency in exchange for financial investments, offering enhanced mobility, security, and access to employment, education, and healthcare within the host country. Golden visa programmes: Countries around the world are strengthening restrictions on unauthorised immigration, whilst maintaining pathways for investment-based residency. Investment visa schemes provide opportunities to obtain residential status or nationality through monetary commitments. Although traditionally popular amongst Chinese, Russian and Middle Eastern investors, these programmes now draw applicants from across the globe. Golden visas allow for investment-linked residency on a temporary or permanent basis. These are linked to applicants making qualifying financial contributions, including property acquisition, enterprise establishment or state fund deposits. The flexible residency requirements of certain programmes appeal to those seeking alternative options whilst retaining freedom of movement. A golden visa programme is a legal pathway where qualified individuals receive residential privileges in a country by making specified financial investments. This differs from citizenship-by-investment schemes, which provide complete citizenship benefits. Through golden visas, wealthy individuals can obtain legal residency status, allowing them to live, pursue employment, education and access healthcare services in their chosen nation. Nations increasingly provide residence and citizenship through investment schemes such as golden visa programmes, featuring diverse investment choices tailored to individual family needs. Golden passports provide \"citizenship by investment”. They deliver comprehensive citizenship privileges, frequently including admission to regional economic zones. Within the European Union, Malta's scheme enables investors to live, work and pursue education across all EU member states. In the Caribbean region, nations including St. Kitts and Nevis, Antigua and Barbuda, and Grenada provide competitive options beginning at approximately $200,000. US President Donald Trump has introduced the \"gold card\" scheme as a replacement for the existing EB-5 visa system. This initiative would grant residency rights and citizenship prospects in exchange for a $5 million investment. Unlike the current EB-5 programme, the proposed scheme suggests direct payment to the US government to address national debt. This arrangement could present an alternative solution for Indian investors facing extensive waiting periods in the current employment-based green card system. Entertainment Lifestyle Lifestyle Lifestyle Food Food Entertainment Lifestyle Food tv", "summary": "International Business News: Countries are tightening immigration rules while offering investment-based residency through golden visa programmes. These visas provide affluent indi", "author": "TOI Business Desk", "date_published": "Mar 09, 2025, 22:00 IST", "keywords": "golden visa,investment visa,residency by investment,citizenship by investment,golden visa benefits,what is golden visa,golden visa cost", "image_url": "https://static.toiimg.com/thumb/msid-118822403,imgsize-93228,width-400,resizemode-4/118822403.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:06:59.567093", "word_count": 367, "read_time": 2, "date_machine": "Mar 09, 2025, 22:00 IST", "tags": ["golden visa", "investment visa", "residency by investment", "citizenship by investment", "golden visa benefits", "what is golden visa", "golden visa cost"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/latest-income-tax-slabs-fy-2025-26-budget-2025-tax-slabs-rates-under-new-income-tax-regime-standard-deduction-personal-taxation-after-budget-2025-full-details-faqs-answered/articleshow/117821239.cms", "headline": "Latest income tax slabs FY 2025-26: What are the new income tax slabs, rates after Budget 2025 announcements? Check new vs old tax regime comparison - FAQs answered", "content": "Trending / TIMESOFINDIA.COM / Budget 2025 saw major income tax changes with FM Nirmala Sitharaman announcing new income tax slabs and income tax rates for FY 2025-26. Middle class salaried taxpayers will find big reason to cheer from the Budget speech. Check the latest income tax slabs and rates for FY 2025-26 post Union Budget 2025: Finance Minister Nirmala Sitharaman announced sweeping changes in the new income tax regime, announcing revamped income tax slabs and income tax rates for the salaried taxpayers, individual taxpayers, common man and middle class. The biggest announcement was that people earning up to Rs 12 lakh income will not have to pay income tax! The three pillars - Democracy, Demography and Demand - form the foundation for our progression towards Viksit Bharat. India's middle class serves as a crucial driving force for economic advancement. The current administration, led by Prime Minister Modi, recognises the middle class's vital contribution and capabilities in building the nation, FM Nirmala Sitharaman said. With effect from assessment year 2026-27, it is proposed that the following rates provided under the proposed clause (iii) of sub-section (1A) of section 115BAC of the Act shall be the rates applicable for determining the income-tax payable in respect of the total income of a person, being an individual or Hindu undivided family or association of persons [other than a co-operative society], or body of individuals, whether incorporated or not, or an artificial juridical person referred to in subclause (vii) of clause (31) of section 2:— Acknowledging the role of middle class, FM Sitharaman said that they have consistently reduced middle class income taxation burden. Since 2014, the 'Nil tax' threshold has seen progressive increases: initially to Rs 2.5 lakh, then to Rs 5 lakh in 2019, and subsequently to Rs 7 lakh in 2023, demonstrating the government's confidence in middle-class taxpayers. A significant announcement introduces tax exemption for incomes up to Rs 12 lakh under the new regime (excluding special rate income like capital gains). For salaried individuals, this threshold extends to Rs 12.75 lakh, factoring in the standard deduction of Rs 75,000. The comprehensive revision of tax slabs and rates aims to benefit all taxpayers, particularly enabling the middle class to retain more disposable income, which should enhance household spending, savings and investment potential. The income tax slabs for FY 2025-26 under the old income tax regime continue to be the same: For regular income up to Rs 12 lakh (excluding special rate income such as capital gains), taxpayers receive a tax rebate alongside benefits from reduced slab rates, effectively eliminating their tax liability. The impact of these modifications can be quantified through specific examples: - At Rs 12 lakh income level: Rs 80,000 tax benefit (complete tax exemption) - At Rs 18 lakh income level: Rs 70,000 tax reduction (30% of previous tax liability) - At Rs 25 lakh income level: Rs 1,10,000 tax saving (25% of previous tax liability) The new income tax slabs have been announced by FM Nirmala Sitharaman. These tax slabs and rates are applicable for the new income tax regime. In this article, a detailed table shows the latest income tax slabs for FY 2025-26. In order to calculate income tax under the new tax regime, an individual needs to first determine their gross income by adding earnings from all sources, such as salary, property, and other sources etc. Next, they should apply the rates available under new tax regime to their income. After calculating the tax for each income slab, sum these amounts to find the total tax. Then, add the Health and Education Cess (4%) and surcharge (if applicable) to determine the final tax liability. Unlike the old regime, the new tax regime does not allow most deductions, such as those under Section 80C or for HRA, but some exemptions remain, such as the employer’s contribution to NPS. From assessment year 2026-27 onwards, for an assessee, being an individual resident in India whose income is chargeable to tax under the sub-section (1A) of section 115BAC, it is proposed to,– (i) enhance the limit of total income for rebate in clause (a) and (b) of first proviso under section 87A, on which the income-tax is payable as per the rates of income-tax under sub-section (1A) of section 115BAC, from Rs. 7,00,000/- to Rs. 12,00,000/- and the limit of rebate in clause (a) of first proviso to section 87A from Rs. 25,000/- to Rs. 60,000/-. (ii) rationalise the first proviso to section 87A by inserting a new proviso so as to provide that the deduction under the first proviso, shall not exceed the amount ofincome-tax payable as per the rates provided in sub-section (1A) of section 115BAC. In the proposed new tax regime, the maximum total income for which tax liability for individual taxpayers is NIL is Rs. 12 lakhs. The benefit of such Nil tax liability mentioned above is available only in the new tax regime. This New tax regime is the default regime. To avail the benefit of rebate allowable under proposed provisions of new tax regime, only return is to be filed otherwise no other step is required to be taken. Any individual earlier was required to pay a tax of Rs 80,000 (in the new regime) for an income of Rs 12 lakh. Now he will be required to pay nil tax on such income. Food travel Lifestyle Lifestyle Lifestyle Lifestyle Entertainment Food Lifestyle", "summary": "India Business News: Budget 2025 saw major income tax changes with FM Nirmala Sitharaman announcing new income tax slabs and income tax rates for FY 2025-26. Middle class", "author": "TOI Business Desk", "date_published": "Updated: Feb 3, 2025, 15:14 IST", "keywords": "Business news,new income tax regime,latest income tax slabs fy 26,income tax slabs,budget income tax slabs,budget 2025", "image_url": "https://static.toiimg.com/thumb/msid-117821263,imgsize-56778,width-400,resizemode-4/117821263.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:00.927713", "word_count": 900, "read_time": 4, "date_machine": "Updated: Feb 3, 2025, 15:14 IST", "tags": ["Business news", "new income tax regime", "latest income tax slabs fy 26", "income tax slabs", "budget income tax slabs", "budget 2025"]},
{"url": "https://timesofindia.indiatimes.com/business/financial-literacy/debt-management/credit-score-tips-7-ways-to-improve-your-cibil-score/articleshow/111630195.cms", "headline": "Credit score tips: 7 ways to improve your CIBIL score", "content": "Trending This story is from July 10, 2024 / TIMESOFINDIA.COM / Improving your credit score takes time and consistent effort. By following these 7 steps, you can gradually enhance your CIBIL score. Your CIBIL score plays a critical role in determining whether your credit application gets approved or denied. A high credit score facilitates easier access to credit cards and loans, often at lower interest rates and with additional benefits. Conversely, a low CIBIL score poses significant challenges for individuals seeking urgent credit. Lenders typically reject applications from those with a poor credit score (600 or below), or approve them with higher interest rates. Improving your CIBIL score requires diligent adherence to specific strategies to enhance creditworthiness. Improving your credit score takes time and consistent effort. By following these, you can gradually enhance your CIBIL score and improve your chances of accessing credit facilities in the future. Paying your loan EMIs on time is crucial for maintaining a good credit score. Missing or delaying payments not only incurs penalties but also negatively impacts your credit score. Consider setting reminders or using Standing Instructions (SI) to automate your EMI payments and avoid any delays. Plan strategically to settle your credit card balances by the due date to avoid negative impacts on your CIBIL score. Non-payment or regular defaults can significantly lower your score. If unable to clear the full amount, at least pay the minimum due to prevent adverse reporting on your credit report . Also Check | Regularly check your CIBIL report for any inaccuracies that could be affecting your credit score. Errors such as incorrect personal information, account details, or overdue amounts can be disputed and corrected online through the CIBIL grievance redressal process, potentially boosting your credit score. Avoid making several credit applications within a short period, as each application triggers a hard enquiry on your credit report. Multiple enquiries can signal financial distress to lenders and lower your credit score. Research and apply to only one provider after careful consideration. If your credit history is impacted by past defaults, consider applying for a secured credit card backed by a fixed deposit. Secured cards can be easier to obtain and using them responsibly by making timely payments can help rebuild your credit score over time. Also Check | Keep older credit card accounts open, even if you no longer use them actively. Longer credit histories and consistent repayment records can positively influence your creditworthiness and support future credit applications. If you've co-signed or guaranteed a loan, monitor its repayment status regularly. Any defaults or delays in payments can affect both the borrower's and co-signer's credit scores. Communicate with the borrower to ensure timely repayments. Food travel Lifestyle Lifestyle Lifestyle Lifestyle Entertainment Food Lifestyle", "summary": "Financial Literacy News: Improving your credit score takes time and consistent effort. By following these 7 steps, you can gradually enhance your CIBIL score.", "author": "TOI Business Desk", "date_published": "Jul 10, 2024, 14:29 IST", "keywords": "loan EMIs,credit score tips,credit score,credit report,credit card,CIBIL score", "image_url": "https://static.toiimg.com/thumb/msid-111630420,imgsize-18008,width-400,resizemode-4/111630420.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:02.313056", "word_count": 455, "read_time": 2, "date_machine": "Jul 10, 2024, 14:29 IST", "tags": ["loan EMIs", "credit score tips", "credit score", "credit report", "credit card", "CIBIL score"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/rx-propellant-sets-up-worlds-1st-ifc-edge-certified-advanced-life-sciences-facility-in-hyds-genome-valley/articleshow/113401255.cms", "headline": "Rx Propellant sets up world's 1st IFC-EDGE certified advanced life sciences facility in Hyd's Genome Valley", "content": "Trending This story is from September 16, 2024 / TNN / HYDERABAD: Life sciences ecosystem developer Rx Propellant on Monday announced the opening of 3GV , which is touted as the world’s first IFC-EDGE (International Finance Corporation- Excellence in Design for Greater Efficiencies) certified advanced life sciences facility . 3GV is a multi-tenant facility spread over 1.5 lakh sq ft that has been set up at an investment of Rs 105 crore and can accommodate over 1,000 people. It houses advanced lab spaces that can be used by companies of all sizes. industries & IT minister Duddilla Sridhar Babu, who inaugurated 3GV, also launched the blueprint and logo of the Hyderabad International Lifesciences Square (HILS), a 300-acre international life sciences corridor being set up by Rx Propellant in Genome Valley phase-2. “These state-of-the-art facilities are not just about building infrastructure; they are about creating a future where Telangana leads the way in life sciences and draws new investments from renowned international companies ,” the minister said. Rx Propellant CEO Milind Ravi said, “Achieving the world’s first IFC-EDGE Advanced certification for a speculative life sciences building reflects our focus on sustainability and innovation. With 41% less energy consumption, 87% reduced water usage, and a 25% decrease in embodied carbon compared to conventional buildings, 3GV sets a new standard for environmentally responsible infrastructure.” Rx Propellant, which has over 6.5 million sq ft of lab space across Hyderabad, Bengaluru and Mumbai, partners with international and domestic life sciences companies to facilitate their expansion by offering lab spaces and manufacturing facilities to support players of all sizes. Lifestyle Entertainment Entertainment Entertainment travel astrology Lifestyle Entertainment Lifestyle", "summary": "India Business News: HYDERABAD: Life sciences ecosystem developer Rx Propellant on Monday announced the opening of 3GV, which is touted as the world’s first IFC-EDGE (Inte.", "author": "Swati Bharadwaj", "date_published": "Sep 16, 2024, 21:11 IST", "keywords": "Business news,Telangana,sustainability,Rx Propellant,life sciences facility,international companies,IFC-EDGE,Hyderabad International Lifesciences Square,Genome Valley,advanced lab spaces,3GV", "image_url": "https://static.toiimg.com/thumb/msid-113401490,imgsize-1429134,width-400,resizemode-4/Representative-Image.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:03.653246", "word_count": 272, "read_time": 1, "date_machine": "Sep 16, 2024, 21:11 IST", "tags": ["Business news", "Telangana", "sustainability", "Rx Propellant", "life sciences facility", "international companies", "IFC-EDGE", "Hyderabad International Lifesciences Square", "Genome Valley", "advanced lab spaces"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/life-certificate-2024-how-to-submit-annual-life-certificate-online-and-offline-a-detailed-guide/articleshow/114941548.cms", "headline": "Life certificate 2024: How to submit Jeevan Pramaan Patra online and offline; a detailed guide", "content": "Trending This story is from November 4, 2024 / TIMESOFINDIA.COM / Pensioners in India are required to submit annual life certificates to continue receiving their pension benefits. The deadline for submission is November 30th, with a grace period for super senior citizens. The government is encouraging digital submissions through the Jeevan Pramaan portal and a nationwide campaign to streamline the process. Pensioners play a vital role in the social fabric of our society, and their financial security is paramount. To ensure continued access to pension benefits, annual life certificate submissions are mandatory for all pensioners. This process, which verifies the pensioner's living status, has been streamlined through various online and offline methods. With the recent initiatives to promote digital submissions, pensioners can conveniently fulfil this requirement and maintain their financial support. The requirement for pensioners to submit their jeevan pramaan patra is a critical process in ensuring the integrity and sustainability of pension funds. By providing multiple submission methods—both online and offline—the government is making it easier for pensioners to comply with this requirement. The ongoing digital campaigns further illustrate the government’s commitment to enhancing the efficiency and accessibility of pension services, ensuring that pensioners receive their benefits without unnecessary delays. The submission window for life certificates opened on November 1 for pensioners under the age of 80. This is part of an annual cycle during which pensioners must reaffirm their eligibility for pension disbursement. The deadline for submitting the life certificate is November 30. If the certificate is not submitted by this deadline, pension payments will be suspended starting in December. This requirement also applies to super senior citizens (aged 80 and above), who were allowed to submit their certificates starting on October 1, with the same November 30 deadline. Pensioners can submit their life certificates through several methods, accommodating various preferences and technological capabilities. Here are the options available: For those choosing to submit their life certificates online through the Jeevan Pramaan Portal, the following steps are involved: For pensioners opting for offline submission, the process is straightforward: If pensioners fail to submit their life certificates by the stipulated deadline, their pension payments will be halted starting the following month. However, payments will resume once the life certificate is submitted, thereby ensuring that pensioners do not permanently lose access to their funds, provided they complete the required process. In an effort to facilitate the submission process, the Department of Pension and Pensioners' Welfare (DoPPW) has initiated its third nationwide digital life certificate (DLC) campaign. This campaign runs from November 1 to November 30, covering 800 cities and districts. The campaign aims to promote the use of digital platforms for certificate submission, ensuring greater accessibility for pensioners. On the first day of this campaign, over 1.8 lakh pensioners successfully generated their digital life certificates, highlighting the growing adoption of technology among pensioners. This indicates a positive trend towards digitalization and the effective use of biometric authentication methods. A life certificate is an official document that verifies a pensioner's living status, required annually to continue receiving pension benefits. All pensioners, including family pensioners, must submit a life certificate to maintain their pension payments. Pensioners under 80 must submit their life certificate between November 1 and November 30 each year. Super senior citizens (80 and above) can submit theirs starting from October 1, with the same deadline. If the life certificate is not submitted by the deadline, pension payments will be suspended starting the following month. Pensioners can submit their life certificates online via the Jeevan Pramaan portal, through doorstep banking agents, using biometric devices at post offices, or in person at bank branches. Pensioners can submit their life certificates online by using the Jeevan Pramaan portal and completing biometric verification through designated apps. Yes, pensioners can submit their life certificates in person at their respective banks or post offices. Generally, you will need your Aadhaar number for biometric verification, along with any other identification or pension-related documents as required by your pension disbursing authority. Pensioners can check the status of their life certificate submission through the Jeevan Pramaan portal or by contacting their bank or pension disbursing authority. Yes, if your submission fails, you can reapply and submit your life certificate again using the same methods available to you. education education education education education education education education education education", "summary": "India Business News: Pensioners in India are required to submit annual life certificates to continue receiving their pension benefits. The deadline for submission is Novem", "author": "TOI Business Desk", "date_published": "Updated: Nov 4, 2024, 16:58 IST", "keywords": "Business news,Submit life certificate online,Submit life certificate offline,Life certificate submission,life certificate,jeevan praman patra,jeevan pramaan certificate,jeevan pramaan,How to submit annual life certificate online,How to submit annual life certificate offline,detailed guide for life certificate 2024", "image_url": "https://static.toiimg.com/thumb/msid-114942014,imgsize-53514,width-400,resizemode-4/114942014.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:04.870425", "word_count": 719, "read_time": 4, "date_machine": "Updated: Nov 4, 2024, 16:58 IST", "tags": ["Business news", "Submit life certificate online", "Submit life certificate offline", "Life certificate submission", "life certificate", "jeevan praman patra", "jeevan pramaan certificate", "jeevan pramaan", "How to submit annual life certificate online", "How to submit annual life certificate offline"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/pune-property-registrations-slump-despite-strong-demand/articleshow/116322414.cms", "headline": "Pune property registrations slump despite strong demand", "content": "Trending This story is from December 14, 2024 / TIMESOFINDIA.COM / Pune saw an 11% dip in property registrations this November, totaling 13,371 units and generating Rs 475 crore in revenue. Experts attribute this decline to robust September sales, increased property prices, and the shifting festive season timeline. Despite the drop, market demand remains strong, driven by infrastructure development, affordability, and employment opportunities. NEW DELHI: Property registrations in Pune dropped 11 per cent in November despite strong demand in the market. Real estate consultant Knight Frank India revealed on Saturday that the city recorded 13,371 property registrations, generating Rs 475 crore in revenue, against 14,988 units during the same period last year. The registration also saw a significant decline of 36 percent compared to the previous month of October, which recorded 20,894 units. Shishir Baijal, chairman and managing director at Knight Frank India said, \"Pune's property market continues to exhibit steady registrations, adapting to evolving buyer preferences and market conditions\". Rohit Gera, managing director of Pune-based Gera Developments, said that the drop in November registrations was a result of sales made in September. \"There has been a marginal slowdown in sales as a result of increased prices as well as increased sizes of homes, taking the total home prices to the boundary of affordability. The other reason for the month's slowdown in numbers could be because of the change in dates of the festive season each year,” Gera said. He further added that it would take some months to comment on whether it is an aberration or a trend. InfraMantra Director and co-founder Garvit Tiwari also commented on the decline, \"The drop in property registration in Pune in November is not symptomatic of any weakness in the market\". He stated that the market continues to exhibit strong demand from property seekers, and any decline may be due to the high base effect. Additionally, the previous year marked a boom for the housing market, with record-breaking property sales across Indian cities. \"Strong infrastructure growth, affordability, employment opportunities and homeownership sentiments have been the strong drivers for the Pune housing market,\" he said. Lifestyle astrology tv Lifestyle tv Lifestyle Entertainment Entertainment Entertainment Lifestyle", "summary": "India Business News: Pune saw an 11% dip in property registrations this November, totaling 13,371 units and generating Rs 475 crore in revenue. Experts attribute this dec", "author": "TOI Business Desk", "date_published": "Dec 14, 2024, 21:41 IST", "keywords": "Pune property registrations,real estate market Pune,Knight Frank India,Pune housing market,property sales decline", "image_url": "https://static.toiimg.com/thumb/msid-116322437,imgsize-19842,width-400,resizemode-4/116322437.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:05.577070", "word_count": 361, "read_time": 2, "date_machine": "Dec 14, 2024, 21:41 IST", "tags": ["Pune property registrations", "real estate market Pune", "Knight Frank India", "Pune housing market", "property sales decline"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-today-sensex-rises-150-points-nifty-opens-at-23790/articleshow/116668341.cms", "headline": "Sensex ended flat at 78,472, Nifty gains 0.1% to close at 23,750 on expiry day", "content": "Trending This story is from December 26, 2024 / TIMESOFINDIA.COM / NEW DELHI: Indian benchmark indices and ended flat amid volatile session on Thursday, as gains in auto stocks were offset by losses in the banking and FMCG sectors, reflecting the approaching year-end. Se x dipped marginally by 0.39 points to 78,472.48, while the NSE Nifty gained 22.55 points, or 0.1%, to settle at 23,750.20 on the monthly expiry day. Among the 30 blue-chip stocks, Adani Ports, Shriram Finance, State Bank of India, Maruti, Axis Bank, ICICI Bank, Mahindra & Mahindra, and Power Grid were among the top gainers. In contrast, Titan, Asian Paints, Nestle, Tech Mahindra, Reliance Industries, Zomato, Larsen & Toubro, and Bajaj Finserv were the top losers. However, broader indices, including small-cap and mid-cap stocks, also ended the day flat. Market opened marginally higher on the opening trade after a mid-week break for the Christmas holiday. However, the initial gains were short-lived as persistent market pressures weighed on investor sentiment, dimming hopes for a year-end rally. By 11.15 am, the BSE Sensex traded at 78,510.17, up just 37.30 points (0.05%), while the Nifty50 hovered around 23,756.80, a modest gain of 29.15 points (0.12%). The Sensex opened at 78,877.12, marking an initial rise of 404.25 points (0.52%), while the Nifty50 began the day at 23,790.85, up by 63.20 points (0.27%). This followed Tuesday’s moderate rally, where Sensex closed at 78,636.97, up 164.10 points (0.21%), and Nifty finished at 23,790.85, gaining 63.20 points (0.27%). Among sectoral indices, Nifty Auto, FMCG, IT, Media, and PSU Bank recorded gains, while other sectors traded in the red. In the Nifty50 pack, 31 stocks opened higher. Top gainers included Britannia, TCS, Tata Motors, Nestle India, and Hero Motors. On the other hand, 19 stocks declined, with JSW Steel, IndusInd Bank, and Shriram Finance leading the losses. I n the Asian markets, Tokyo and Shanghai closed in positive territory, while Seoul ended in the red. Meanwhile, US markets remained closed on Wednesday for the Christmas holiday. Foreign Institutional Investors (FIIs) sold equities worth Rs 2,454.21 crore on Tuesday, as per exchange data. Analysts attribute the market's subdued performance to external and internal headwinds. The strong US dollar and high bond yields have led Foreign Institutional Investors (FIIs) to sell during rallies, while domestic concerns such as slowing economic growth and weaker corporate earnings have added pressure. As the year-end nears, market experts advise a cautious approach. “Investors should prioritise safety over returns in the current context,” V K Vijayakumar, chief investment strategist at Geojit Financial Services told PTI, highlighting the dual impact of external and internal challenges on market sentiment. education Lifestyle Entertainment education Lifestyle tv Lifestyle astrology Lifestyle Entertainment", "summary": "India Business News: NEW DELHI: Indian benchmark indices Sensex and Nifty ended flat amid volatile session on Thursday, as gains in auto stocks were offset by losses in th.", "author": "TOI Business Desk", "date_published": "Updated: Dec 26, 2024, 16:27 IST", "keywords": "stoke market today,sensex,nifty,bank nifty,BSE,NSE", "image_url": "https://static.toiimg.com/thumb/msid-116668267,imgsize-104558,width-400,resizemode-4/116668267.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:07.043756", "word_count": 446, "read_time": 2, "date_machine": "Updated: Dec 26, 2024, 16:27 IST", "tags": ["stoke market today", "sensex", "nifty", "bank nifty", "BSE", "NSE"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/seci-inks-ppa-with-r-power-arm-for-1-4-gw-solar-storage-project/articleshow/120831412.cms", "headline": "SECI inks PPA with R-Power arm for 1.4 GW solar storage project", "content": "Trending This story is from May 02, 2025 / TNN / Reliance Power has secured a significant 25-year power purchase agreement with SECI for a 1.4 GW solar and battery storage project. Reliance Nu Suntech will build the project with a Rs 10,000 crore investment, supplying 930 MW of power at Rs 3.53 per unit. NEW DELHI: Reliance Power has secured a 25-year PPA (power purchase agreement) with SECI for a 1.4 gigawatts solar and battery storage project to be built by subsidiary Reliance Nu Suntech, marking the single-largest deal inked by the government’s renewable project aggregator in recent times. Reliance will supply 930 MW of power at Rs 3.53 per unit from the single-location project to be built over the next 24 months at an investment of Rs 10,000 crore. The project includes a battery storage system offering a backup of 465 MW for four hours, the company said on Friday. The capacity allotted to Reliance was also the single-largest award in SECI’s tranche XVII auction that concluded in December 2024. The comany has submitted a performance bank guarantee of Rs 378 crore to SECI. The PPA provides a comfort level for the project, especially in raising debt. Currently, some 40 GW of capacity offered in various tranches of SECI auction is struggling to secure PPAs. Entertainment Entertainment Lifestyle tv Entertainment Lifestyle tv Entertainment Lifestyle tv", "summary": "India Business News: Reliance Power has entered a significant 25-year power purchase agreement with SECI for a 1.4 GW solar and battery storage project, further establishing its position in the renewable energy sector.", "author": "Sanjay Dutta", "date_published": "May 02, 2025, 23:10 IST", "keywords": "Reliance Power, SECI, 1.4 GW solar power, renewable energy, battery storage", "image_url": "https://static.toiimg.com/thumb/msid-120831660,imgsize-39514,width-400,resizemode-4/seci-inks-ppa-with-r-power-arm-for-14-gw-solar-storage-project.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:08.249476", "word_count": 227, "read_time": 1, "date_machine": "May 02, 2025, 23:10 IST", "tags": ["Reliance Power", "SECI", "1.4 GW solar power", "renewable energy", "battery storage"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/rbi-payout-to-government-may-touch-rs-3-lakh-crore-for-fy25-a-jump-of-nearly-50/articleshow/121229886.cms", "headline": "RBI payout to government may touch Rs 3 lakh crore for FY25, a jump of nearly 50%", "content": "Trending This story is from May 17, 2025 / TIMESOFINDIA.COM / The RBI's central board is set to meet on May 23 to review its balance sheet and discuss surplus fund transfers to the government, potentially reaching Rs 3 lakh crore, a 50% increase from last year. The board also reviewed the Economic Capital Framework on May 15. Experts anticipate a dividend payout between Rs 2. NEW DELHI: The Reserve Bank of India's (RBI) central board of directors is expected to meet on May 23 to conduct its annual review of the central bank's balance sheet and discuss the transfer of surplus funds for FY25 to the government. The payout could be as high as Rs 3 lakh crore, exceeding last year's dividend by nearly 50%. The board also met on May 15 to review the Economic Capital Framework (ECF), a crucial factor in determining the surplus or the dividend. \"We estimate an RBI dividend of Rs 2.6 lakh to Rs 3 lakh crore, depending on the level of provisioning,\" said Gaura Sen Gupta, chief economist at IDFC First Bank, according to a report by ET. \"The markets have largely factored in a dividend of approximately Rs 2.5 lakh crore. Any upside on the number would have an impact on bond yields,\" said Alok Singh, group treasury head at CSB Bank. Contingency provisions are anticipated to be on par with or higher than last year. According to IDFC First Bank, provisions amounted to Rs 42,800 crore previously and are expected to range between Rs 40,000 - Rs 80,000 crore this year. The relevant committee had recommended risk provisioning under the Contingent Risk Buffer (CRB) be maintained within a range of 6.5-5.5% of the RBI's balance sheet. The size of the CRB is closely linked to the pace of economic growth, as it is determined by the board based on the economy’s performance during the period. Additionally, the final payout amount also depends on the central bank’s earnings from various domestic sources. tv Entertainment Entertainment Entertainment Lifestyle Lifestyle tv Lifestyle Lifestyle tv", "summary": "India Business News: The RBI's central board is set to meet on May 23 to review its balance sheet and discuss surplus fund transfers to the government, potentially reachin", "author": "TOI Business Desk", "date_published": "May 17, 2025, 12:18 IST", "keywords": "RBI payout to government,RBI surplus transfer FY25,Reserve Bank of India 2025 dividend,RBI Economic Capital Framework,RBI contingency provision,CRB risk provisioning,bond yields impact,government revenue from RBI,central bank balance sheet review,IDFC First Bank report", "image_url": "https://static.toiimg.com/thumb/msid-121229946,imgsize-881448,width-400,resizemode-4/untitled-design-65.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:09.560888", "word_count": 341, "read_time": 2, "date_machine": "May 17, 2025, 12:18 IST", "tags": ["RBI payout to government", "RBI surplus transfer FY25", "Reserve Bank of India 2025 dividend", "RBI Economic Capital Framework", "RBI contingency provision", "CRB risk provisioning", "bond yields impact", "government revenue from RBI", "central bank balance sheet review", "IDFC First Bank report"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/private-capex-in-india-grows-at-19-8-cagr-credit-growth-remains-same-reports/articleshow/121230103.cms", "headline": "Private capex in India grows at 19.8% CAGR; credit growth remains same: Reports", "content": "Trending This story is from May 17, 2025 / TIMESOFINDIA.COM / India's private capital expenditure experienced robust growth, with a CAGR of 19.8 per cent from FY21 to FY25E, driven by sectors like oil and gas and power. This growth, however, didn't translate into higher bank credit growth as companies primarily used strong internal cash flows for funding. NEW DELHI: The private capital expenditure growth in India reported a CAGR of 19.8 per cent in the last five years from FY21 to FY25E. This growth was led by key sectors such as oil and gas, power, automobiles, and commodities, said news agency ANI as per a report by HDFC Securities. The report noted that while private capex growth was robust during this period, it did not result in higher credit growth for the banking system. This was due to the fact that most of the capital expenditure was funded by strong cash flows from operations, reducing the need for bank credit. It said \"private capex growth has been robust from FY21 to FY25E, reporting a CAGR of 19.8 per cent... Private capex growth wasn't reflected in the credit growth of the banking system as almost entire capex was financed by strong cash flows from operations in this period, thus limiting the need for bank credit\". The report further noted that the top 250 private companies (excluding BFSI) incurred a total capital expenditure of Rs 29.6 trillion between FY20 and FY24, which amounted to only around 57% of their total cash flow of Rs 52.7 trillion during the same period. This suggests that companies had sufficient internal resources and surplus cash to fund their investment plans without increasing their debt. It also explains the absence of significant capex-driven credit growth in the banking sector during this period. The report also said that capital expenditure by the top 250 listed private companies saw a substantial rise, increasing from Rs 4,833 billion in FY21 to Rs 8,426 billion in FY24. It is further expected to rise to Rs 9,951 billion in FY25E. There was also a sharp increase in the capital expenditure of the central government as well over the same period. Central capex rose from Rs 4,263 billion in FY21 to an estimated Rs 10,184 billion in FY25, reflecting a CAGR of 24.3%. Major contributors being the ministries related to road transport, railways, defence, and capex-related transfers to states. However, the state government capital expenditure lagged behind. While state capex rose from Rs 4,223 billion in FY21, the CAGR grw at a slower rate of 11.9% from FY21 to FY25E. While it grew by 28% , 11%, and 26% in the next three years, it has declined by 20 per cent year-on-year so far in FY25E to Rs 6,075 billion (till February 2025). Uttar Pradesh, Maharashtra, Madhya Pradesh, Tamil Nadu, Gujarat, and Odisha were the main contributors to the state capex growth. tv Entertainment Entertainment Entertainment Lifestyle Lifestyle tv Lifestyle Lifestyle tv", "summary": "India Business News: India's private capital expenditure experienced robust growth, with a CAGR of 19.8 per cent from FY21 to FY25E, driven by sectors like oil and gas and", "author": "TOI Business Desk", "date_published": "May 17, 2025, 12:25 IST", "keywords": "India private capital expenditure,CAGR 19.8%,HDFC Securities report,private capex growth sectors,bank credit growth,capital expenditure by private companies,state government capital expenditure", "image_url": "https://static.toiimg.com/thumb/msid-121230155,imgsize-634352,width-400,resizemode-4/private-capex-in-india-grows-at-198-cagr.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:10.960721", "word_count": 490, "read_time": 2, "date_machine": "May 17, 2025, 12:25 IST", "tags": ["India private capital expenditure", "CAGR 19.8%", "HDFC Securities report", "private capex growth sectors", "bank credit growth", "capital expenditure by private companies", "state government capital expenditure"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/indian-markets-get-boost-as-fpis-invest-rs-18620-crore-in-may-amid-uncertainty/articleshow/121233164.cms", "headline": "Indian markets get boost as FPIs invest Rs 18,620 crore in May amid uncertainty", "content": "Trending This story is from May 17, 2025 / TIMESOFINDIA.COM / Foreign Portfolio Investors (FPIs) displayed strong confidence in Indian equities this week, injecting ₹4,452.3 crore between May 13-16, with Friday marking the peak inflow. Despite a volatile Tuesday, May's total FPI investment reached ₹18,620 crore. While significant outflows marked the year's initial months, April saw a shift with net investments. NEW DELHI: Foreign Portfolio Investors (FPIs) made strong investments in the Indian equity markets this week, bringing in Rs 4,452.3 crore between May 13 and May 16, according to data from the National Securities Depository Limited (NSDL), reported by news agency ANI. FPIs recorded their highest inflow of the week on Friday, investing a net Rs 5,746 crore into Indian equities. However, the overall trend remained volatile, with Tuesday seeing a significant net outflow of Rs 2,388 crore — likely reflecting investor caution or profit booking amid market uncertainty. The total FPI investment into Indian equities in the month of May has now reached Rs 18,620 crore. Despite the strong inflow in May, FPI outflow stands at Rs 93,731 crore. The primary reason being the heavy selling seen in the first three months of the year when global uncertainties and rising US bond yields negatively impacted investor sentiment. Net FPI investment in Indian equities stood at Rs 4,223 crore in April, marking a shift in foreign investment trends. According to NSDL data, FPIs sold stocks worth Rs 3,973 crore from Indian equities in March. The selling was even more intense in the first two months of the year, with net outflows of Rs78,027 crore and Rs 34,574 crore in January and February. Last week, the benchmark indices saw a strong rally, with the Nifty rising 4.2% and the Sensex gaining 2,875 points. All major sectoral indices traded in positive territory, with Defense, Realty, and Capital Market sectors leading the way. Defense gained 17%, Capital Market 11.50%, and Realty 10.85%. Lifestyle tv Lifestyle Lifestyle Lifestyle tv astrology Lifestyle Lifestyle Lifestyle", "summary": "India Business News: Foreign Portfolio Investors (FPIs) displayed strong confidence in Indian equities this week, injecting ₹4,452.3 crore between May 13-16, with Friday m", "author": "TOI Business Desk", "date_published": "May 17, 2025, 15:16 IST", "keywords": "Foreign Portfolio Investors,Indian equity markets,FPI investment May 2023,NSDL data,Indian benchmark indices,market volatility,sectoral indices performance,Investing in India", "image_url": "https://static.toiimg.com/thumb/msid-121233171,imgsize-974998,width-400,resizemode-4/private-capex-in-india-grows-at-198-cagr-4.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:12.127330", "word_count": 330, "read_time": 2, "date_machine": "May 17, 2025, 15:16 IST", "tags": ["Foreign Portfolio Investors", "Indian equity markets", "FPI investment May 2023", "NSDL data", "Indian benchmark indices", "market volatility", "sectoral indices performance", "Investing in India"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/silver-at-record-high-price-hits-rs-1-41-lakh/kg-as-festival-demand-soars-gold-up-rs-330/10g/articleshow/124164734.cms", "headline": "Silver at record high! Price hits Rs 1.41 lakh/kg as festival demand soars; gold up Rs 330/10g", "content": "Trending / TIMESOFINDIA.COM / Silver prices reached a new record high in India. Gold also gained in the national capital. Strong festival demand and investor interest fueled these increases. Global uncertainties supported safe-haven purchasing. Domestic bullion markets showed strength despite international trends. Analysts anticipate continued support for precious metals. Silver prices experienced a substantial surge of Rs 1,900, reaching a new record of Rs 1,41,900 per kilogram, while gold increased by Rs 330 in the national capital on Friday due to strong stockist demand and festival-related purchasing, as reported by the All India Sarafa Association, quoted by PTI. Silver, which had previously closed at Rs 1,40,000 per kilogram, continued its upward trend due to strong physical demand and investor interest, according to the association. Since December 31, 2024, silver prices have increased by Rs 52,200 per kilogram or 58.19% from Rs 89,700 per kilogram. The continuous rise in silver prices is attributed to the current festival season, increased industrial usage, and heightened safe-haven purchasing amidst global uncertainties. Market participants indicated that despite weak global indicators, domestic bullion markets remained strong due to consistent purchasing by jewellers, stockists, and retail buyers. Meanwhile, pure gold (99.9%) increased by Rs 330 to Rs 1,17,700 per 10 grams (all taxes included), from its previous value of Rs 1,17,370 per 10 grams on Thursday. Gold of 99.5% purity increased by Rs 400 to Rs 1,17,100 per 10 grams, compared to Rs 1,16,700 per 10 grams in the previous trading session. Gold prices have increased by Rs 38,750 per 10 grams, or 49.08%, from Rs 78,950 per 10 grams since December 31, 2024, demonstrating significant growth due to consistent investor interest and seasonal demand. \"Gold traded with a modest positive bias on Friday, supported by haven buying, while a general risk-off sentiment in broader markets continued to strengthen demand for precious metals,\" said Saumil Gandhi, Senior Analyst - Commodities at HDFC Securities. \"Meanwhile, US President Trump announced a new round of tariffs on imported drugs, trucks, and furniture set to take effect on October 1. This announcement renewed trade-related uncertainty and increased demand for safe haven metals,\" he added. \"Silver hit a fresh record high in the domestic market, taking bullish cues from global markets. The white metal rose above USD 45 an ounce for the first time in 14 years, driven by strong inflows into ETFs, high demand, and tighter physical availability,\" Gandhi further noted. Internationally, both precious metals showed decline. Spot gold decreased by 0.12% to USD 3,744.75 per ounce, while silver reduced by 0.35% to USD 45.03 per ounce. On the Multi Commodity Exchange (MCX), October gold futures increased by Rs 391 or 0.35% to Rs 1,13,020 per 10 grams. December gold futures also rose by Rs 198 or 0.17% to Rs 1,14,069 per 10 grams. December silver futures increased by Rs 1,243 or 0.90% to reach Rs 1,38,299 per kilogram. March 2026 silver futures also achieved a new high, increasing by Rs 1,225 or 0.88% to Rs 1,39,627 per kilogram on the MCX. Market analysts noted that recent increases in domestic bullion prices were primarily demand-driven, supported by festival purchases and anticipated global monetary easing. \"With central banks continuing to diversify their reserves and the rupee showing signs of weakness, precious metals are likely to remain well supported,\" they added, as quoted by PTI. In international markets, December gold futures increased by 0.28% to USD 3,781.82 per ounce while December silver futures rose nearly 2% approaching a 14-year high of USD 45.93 per ounce. Entertainment tv Entertainment Entertainment Entertainment Lifestyle Entertainment Lifestyle Lifestyle Lifestyle", "summary": "India Business News: Silver prices reached a new record high in India. Gold also gained in the national capital. Strong festival demand and investor interest fueled these", "author": "TOI Business Desk", "date_published": "Sep 26, 2025, 22:37 IST", "keywords": "silver prices surge,gold prices increase,record high silver prices,market analysis on gold and silver,All India Sarafa Association,global gold and silver market trends", "image_url": "https://static.toiimg.com/thumb/msid-124165292,imgsize-121621,width-400,resizemode-4/i-arrange-gleaming-precious-metals.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:13.380659", "word_count": 592, "read_time": 3, "date_machine": "Sep 26, 2025, 22:37 IST", "tags": ["silver prices surge", "gold prices increase", "record high silver prices", "market analysis on gold and silver", "All India Sarafa Association", "global gold and silver market trends"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/india-us-trade-deal-commerce-ministry-shares-update-on-piyush-goyals-visit-says-aim-to-achieve-early-conclusion/articleshow/124154344.cms", "headline": "India-US trade deal: Commerce Ministry shares update on Piyush Goyal’s visit; says aim to ‘achieve early conclusion’", "content": "Trending / TIMESOFINDIA.COM / India and the US are committed to progressing towards a trade agreement, as stated by the Ministry of Commerce & Industry. During Commerce Minister Piyush Goyal's visit to the US, both sides discussed potential aspects of the deal and agreed to continue discussions for a mutually beneficial outcome. India-US trade deal talks: India and the US have decided to continue working towards an early conclusion to the trade agreement, according to a statement by the Ministry of Commerce & Industry. Sharing an update on Commerce Minister ’s visit to America, the ministry said, “The delegation had constructive meetings with the U.S. Government on various aspects of the deal. Both sides exchanged views on possible contours of the deal and it was decided to continue the engagements with a view to achieve early conclusion of a mutually beneficial Trade Agreement.” A delegation headed by Piyush Goyal conducted an official visit to the US from September 22-24, 2025. During the visit, Goyal engaged in discussions with Ambassador Jamieson Greer, United States Trade Representative and Sergio Gor, US Ambassador designate to India. Beyond official meetings with US government officials regarding bilateral trade matters, the delegation conducted discussions with prominent US-based businesses and investors to enhance trade and investment relations between India and the United States, the ministry statement said. “The meetings with businesses and investors evoked positive response. The business leaders reposed confidence in the India growth story and expressed their desire to intensify their business activities in India,” it added. Earlier this month, a delegation of US officials, headed by Brendan Lynch, visited New Delhi, where both nations committed to strengthen their efforts towards achieving a trade agreement. India maintains its firm position on agricultural and dairy sectors, whilst acknowledging the necessity for a fresh perspective in discussions with the US after the 50% tariff implementation, according to a TOI report. Lifestyle Lifestyle Lifestyle Entertainment tv Entertainment Lifestyle tv Entertainment Entertainment", "summary": "India Business News: India and the US are committed to progressing towards a trade agreement, as stated by the Ministry of Commerce & Industry. During Commerce Minister Pi", "author": "TOI Business Desk", "date_published": "Updated: Sep 26, 2025, 16:51 IST", "keywords": "India-US trade deal,piyush goyal,donald trump,donald trump tariffs,india-us trade deal talks", "image_url": "https://static.toiimg.com/photo/63379366.cms", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:14.287761", "word_count": 323, "read_time": 2, "date_machine": "Updated: Sep 26, 2025, 16:51 IST", "tags": ["India-US trade deal", "piyush goyal", "donald trump", "donald trump tariffs", "india-us trade deal talks"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/rare-earth-elements-president-murmu-says-india-must-become-self-reliant-important-for-ensuring-national-security/articleshow/124153727.cms", "headline": "Rare earth elements: President Murmu says India must become self-reliant; ‘important for ensuring national security’", "content": "Trending / TIMESOFINDIA.COM / President Murmu emphasized India's need for self-reliance in rare earth element production to become a developed and secure nation. Speaking at the National Geoscience Awards 2024, she highlighted the importance of homegrown techniques for identifying these crucial minerals, essential for modern technologies like AI and clean energy. President Droupadi Murmu on Friday highlighted the need for India to become self-reliant in producing rare earth elements, saying this is vital in the current geopolitical climate and will play a key role in the country’s journey towards becoming a developed nation. Speaking at the National Geoscience Awards 2024, she further added that it would ensure the security of the country. The President explained that these minerals are not considered rare because of their limited supply, but because the process of identifying them is highly complex. She also highlighted that developing homegrown techniques would be crucial in overcoming this challenge. President Murmu pointed out that rare earth elements are central to the technologies shaping the modern world, from artificial intelligence and semiconductors to clean energy solutions. The rare earth elements or REEs are a group of 17 chemically alike metallic elements which are of vital importance to the development of modern technologies including smartphones, electric vehicles, renewable energy systems and wind turbines. She said the mines ministry is working to ensure sustainability and innovation in the sector, with projects that include AI- and drone-based surveys and efforts to extract valuable materials from mine tailings. The President also used the occasion to highlight the need for better disaster preparedness. Referring to the heavy damage caused this year by cloudbursts and landslides, she urged scientists to strengthen research into floods, landslides, earthquakes and tsunamis. \"It is my appeal to the geoscientist community to pay more attention on the research of natural calamities like flood, landslide, earthquake, and tsunami,\" she said, adding that new technologies should be developed to ensure timely alerts reach the public. Instituted in 1966 by the mines ministry and earlier known as the National Mineral Awards, the National Geoscience Awards remain one of the country’s most prestigious honours in the geoscience field. Lifestyle Lifestyle Lifestyle Entertainment tv Entertainment tv Lifestyle Entertainment Entertainment", "summary": "India Business News: President Murmu emphasized India's need for self-reliance in rare earth element production to become a developed and secure nation. Speaking at the Na", "author": "TOI Business Desk", "date_published": "Sep 26, 2025, 14:32 IST", "keywords": "rare earth elements,India self-reliance,National Geoscience Awards,President Droupadi Murmu,mines ministry", "image_url": "https://static.toiimg.com/thumb/msid-124153689,imgsize-63096,width-400,resizemode-4/president-murmu.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:15.812767", "word_count": 364, "read_time": 2, "date_machine": "Sep 26, 2025, 14:32 IST", "tags": ["rare earth elements", "India self-reliance", "National Geoscience Awards", "President Droupadi Murmu", "mines ministry"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/fast-lane-ahead-pm-modi-inaugurate-dwarka-expressways-delhi-section-and-uer-ii-projects-today-route-cost-connectivity-10-things-to-know/articleshow/123341532.cms", "headline": "Fast Lane Ahead! PM Modi inaugurates Dwarka Expressway’s Delhi section and UER-II projects — Route, cost, connectivity; 10 things to know", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Narendra Modi is set to inaugurate the Delhi section of the Dwarka Expressway and the Urban Extension Road-II, projects worth nearly Rs 11,000 crore. These initiatives aim to decongest Delhi, improve connectivity, and significantly reduce travel time between key locations like the Singhu border and IGI Airport, while also lowering pollution. NEW DELHI: Prime Minister inaugurated two major highway projects in Delhi-NCR on Sunday afternoon— the Delhi section of and the Urban Extension Road-II (UER-II). These projects are designed to decongest Delhi, improve connectivity, cut travel time and reduce pollution. The PM inaugurated the 10.1-km Delhi section of Dwarka Expressway and the Alipur–Dichaon Kalan stretch of UER-II with links to Bahadurgarh and Sonipat. Combined cost of the projects is nearly Rs 11,000 crore — Rs 5,360 crore for Dwarka Expressway’s Delhi section and Rs 5,580 crore for UER-II. Package I runs 5.9 km from Shiv Murti intersection to Dwarka Sector-21 RUB, while Package II covers 4.2 km to the Delhi-Haryana border. The Delhi section complements the 19-km Haryana stretch of Dwarka Expressway, inaugurated by the PM in March 2024. The expressway will connect Yashobhoomi, Delhi Metro’s Blue and Orange lines, the upcoming Bijwasan railway station and Dwarka cluster bus depot. The new corridor runs from NH-44 (Alipur) to NH-48 (Mahipalpur) via Mundka, Bakkarwala, Najafgarh and Dwarka, with spurs to Bahadurgarh and Sonipat. The projects will ease pressure on Inner and Outer Ring Roads and junctions like Mukarba Chowk, Madhuban Chowk, Peeragarhi Chowk, Dhaula Kuan and NH-9. Travel from Singhu border to IGI Airport will drop from nearly two hours to just 40 minutes. North-to-south Delhi trips will also be smoother, and goods movement across NCR will become faster. Reduced congestion and shorter journeys are expected to lower fuel consumption and cut vehicular emissions, aiding efforts to fight Delhi’s air pollution. The road transport ministry has taken up projects worth over Rs 50,000 crore to decongest Delhi and boost regional connectivity, with more in the pipeline. Lifestyle Lifestyle Lifestyle Lifestyle Entertainment Lifestyle Entertainment Lifestyle tv Entertainment", "summary": "Infrastructure News: Prime Minister Narendra Modi is set to inaugurate the Delhi section of the Dwarka Expressway and the Urban Extension Road-II, projects worth nearly Rs", "author": "TOI Business Desk", "date_published": "Updated: Aug 17, 2025, 18:09 IST", "keywords": "Narendra Modi,Dwarka Expressway,Urban Extension Road-II,Delhi-NCR highway projects,traffic decongestion,travel time savings Delhi,Delhi infrastructure,road transport ministry,Government of India", "image_url": "https://static.toiimg.com/photo/63379366.cms", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:16.918263", "word_count": 341, "read_time": 2, "date_machine": "Updated: Aug 17, 2025, 18:09 IST", "tags": ["Narendra Modi", "Dwarka Expressway", "Urban Extension Road-II", "Delhi-NCR highway projects", "traffic decongestion", "travel time savings Delhi", "Delhi infrastructure", "road transport ministry", "Government of India"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/rs-11000-crore-infra-boost-for-delhi-ncr-pm-modi-inaugurates-dwarka-expressways-section-uer-ii-projects-aimed-to-ease-congestion-curb-pollution/articleshow/123343711.cms", "headline": "Rs 11,000-crore infra boost for Delhi-NCR: PM Modi inaugurates two highway projects; aimed to ease congestion, curb pollution", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Narendra Modi inaugurated two significant highway projects in Delhi-NCR, totaling nearly Rs 11,000 crore. These projects include the Delhi section of the Dwarka Expressway and the Alipur–Dichaon Kalan stretch of Urban Extension Road-II (UER-II). Prime Minister Narendra Modi on Sunday inaugurated two major highway projects worth nearly Rs 11,000 crore in Delhi-NCR. The 10.1-km Delhi section of the and the Alipur–Dichaon Kalan stretch of Urban Extension Road-II (UER-II) were given the greenlight on August 17 afternoon in Rohini. Ahead of the launch, PM Modi reviewed the sites and interacted with shramyogis (construction workers). Then after the launch he addressed the gathering focusing on the significance of the projects. \"“The expressway is named after Dwarka, the event is being held in Rohini, and the atmosphere is filled with the joy of Janmashtami. I too belong to the land of Dwarka, and today the entire environment has become truly 'Krishnamayi',\" he said. Further talking about how the new infrastructures would potentially aid easing congestion he added, \"This month of August is coloured in the colours of freedom and revolution. In the midst of this festival of freedom, today, the country's capital, Delhi, is witnessing a development revolution. A little while ago, Delhi got the connectivity of Dwarka Expressway and Urban Extension Road. This will increase the convenience of the people of the entire NCR of Delhi, Gurugram. \"", "summary": "Infrastructure News: Prime Minister Narendra Modi inaugurated two significant highway projects in Delhi-NCR, totaling nearly Rs 11,000 crore. These projects include the De", "author": "TOI Business Desk", "date_published": "Updated: Aug 17, 2025, 17:45 IST", "keywords": "Dwarka Expressway,Urban Extension Road-II,Delhi-NCR infrastructure,PM Modi inaugurates highway projects,Delhi air pollution,Rs 11,000 crore investment,travel time reduction Delhi,Delhi transport projects", "image_url": "https://static.toiimg.com/photo/63379366.cms", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:17.682351", "word_count": 232, "read_time": 1, "date_machine": "Updated: Aug 17, 2025, 17:45 IST", "tags": ["Dwarka Expressway", "Urban Extension Road-II", "Delhi-NCR infrastructure", "PM Modi inaugurates highway projects", "Delhi air pollution", "Rs 11", "000 crore investment", "travel time reduction Delhi", "Delhi transport projects"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/rajasthan-to-get-a-new-airport-cabinet-gives-nod-for-greenfield-kota-bundi-airport-top-things-to-know/articleshow/123384356.cms", "headline": "Rajasthan to get a new airport! Cabinet gives nod for Greenfield Kota-Bundi airport; top things to know", "content": "Trending / TIMESOFINDIA.COM / The Cabinet Committee on Economic Affairs, led by Prime Minister Narendra Modi, has approved the development of a new greenfield airport in Kota-Bundi, Rajasthan. The Airports Authority of India (AAI) will construct the airport at an estimated cost of Rs 1507 crore. The new airport will accommodate A-321 type aircraft and manage the expected increase in traffic in the area. Kota to get a new airport! The Cabinet Committee on Economic Affairs, led by Prime Minister Narendra Modi, has approved the Airports Authority of India's (AAI) proposal to develop a green field Airport in Kota-Bundi, Rajasthan. The new airport will be constructed at an estimated cost of Rs 1507 crore. The Rajasthan Government has allocated 440.06 hectares of land to AAI for the airport's development, which will accommodate A-321 type aircraft. The project includes a Terminal Building covering 20,000 sqm, designed to handle 1,000 peak hour passengers (PHP) and an annual capacity of 2 million passengers per annum (MPPA). It will also feature a 3200m x 45m runway 11/29, an apron with 7 parking bays for A-321 aircraft, two link taxiways, an ATC-cum-technical block, a fire station, a car park, and related infrastructure. Kota, located along the Chambal River, is known as Rajasthan's industrial capital and is also famous as India's Educational Coaching Hub. Kota's significance in the educational and industrial fields makes the greenfield Airport an essential infrastructure project, designed to manage the expected increase in traffic in the area. The current Kota Airport is owned by the Airports Authority of India (AAI) and features a runway (08/26) measuring 1220 m x 38 m, which is suitable for Code 'B' aircraft like the DO-228. The airport also has an apron that can accommodate two such aircraft. The terminal building covers an area of 400 sqm and can handle 50 passengers during peak times. However, the existing airport cannot be expanded for commercial operations due to limited land availability and the surrounding urban development. Entertainment Lifestyle Lifestyle Lifestyle Lifestyle tv Entertainment Entertainment tv tv", "summary": "Infrastructure News: The Cabinet Committee on Economic Affairs, led by Prime Minister Narendra Modi, has approved the development of a new greenfield airport in Kota-Bundi", "author": "TOI Business Desk", "date_published": "Aug 19, 2025, 15:29 IST", "keywords": "Kota Airport,green field airport Kota,Kota Bundi Airport development,Rajasthan new airport,Airport Authority of India", "image_url": "https://static.toiimg.com/thumb/msid-123384333,imgsize-42808,width-400,resizemode-4/123384333.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:19.121959", "word_count": 338, "read_time": 2, "date_machine": "Aug 19, 2025, 15:29 IST", "tags": ["Kota Airport", "green field airport Kota", "Kota Bundi Airport development", "Rajasthan new airport", "Airport Authority of India"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/infra-boost-cabinet-clears-rs-8307-crore-bhubaneswar-ring-road-project-to-ease-congestion-and-spur-regional-trade/articleshow/123384610.cms", "headline": "Infra boost: Cabinet clears Rs 8,307 crore Bhubaneswar ring road project, to ease congestion and spur regional trade", "content": "Trending / TIMESOFINDIA.COM / The Cabinet Committee on Economic Affairs has approved the construction of a six-lane Capital Region Ring Road in Odisha. This project aims to reduce congestion in Bhubaneswar, Cuttack, and Khordha. The bypass will connect major National Highways and economic nodes. It will improve freight movement and boost socio-economic growth. The project is also expected to generate significant employment opportunities. The Cabinet Committee on Economic Affairs has approved the construction of a 6-lane access-controlled Capital Region Ring Road (Bhubaneswar Bypass) in Odisha at a capital cost of Rs 8,307.74 crore. According to an official release, the project will be developed on Hybrid Annuity Mode (HAM) and cover 110.875 km between Rameshwar and Tangi. It is aimed at addressing congestion along the existing National Highway corridor passing through Khordha, Bhubaneswar and Cuttack. “The project will provide significant benefit to Odisha and other eastern states by diverting heavy commercial traffic away from Cuttack, Bhubaneswar and Khordha cities. This will enhance the efficiency of freight movement, reducing logistics cost and driving socio-economic growth in the region,” the release said. The alignment will integrate with three major National Highways—NH-55, NH-57 and NH-655—and one State Highway (SH-65). It will also connect with 10 economic nodes, four social nodes and five logistics nodes, while ensuring multimodal connectivity to one major railway station, Bhubaneswar airport, a proposed multi-modal logistics park and two ports at Puri and Astrang. The statement noted that upon completion, the bypass would strengthen connectivity between major religious and economic centres, apart from creating fresh opportunities for trade and industrial growth. It is also expected to generate nearly 74.43 lakh person-days of direct employment and 93.04 lakh person-days of indirect employment. Project details show that of the Rs 8,307.74 crore cost, Rs 4,686.74 crore is earmarked for civil works and Rs 1,029.43 crore for land acquisition. The bypass will form part of the Kolkata–Chennai corridor and is projected to handle an average daily traffic of 28,282 passenger car units in FY25. Entertainment Lifestyle Lifestyle Lifestyle Lifestyle tv Entertainment Entertainment tv tv", "summary": "Infrastructure News: The Cabinet Committee on Economic Affairs has approved the construction of a six-lane Capital Region Ring Road in Odisha. This project aims to reduce", "author": "TOI Business Desk", "date_published": "Aug 19, 2025, 15:43 IST", "keywords": "Bhubaneswar ring road project,Odisha infrastructure development,Cabinet clears Rs 8307 crore project,Hybrid Annuity Mode,National Highway corridor in Odisha", "image_url": "https://static.toiimg.com/thumb/msid-123384637,imgsize-1168215,width-400,resizemode-4/123384637.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:20.200717", "word_count": 340, "read_time": 2, "date_machine": "Aug 19, 2025, 15:43 IST", "tags": ["Bhubaneswar ring road project", "Odisha infrastructure development", "Cabinet clears Rs 8307 crore project", "Hybrid Annuity Mode", "National Highway corridor in Odisha"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/infra-boost-for-kolkata-pm-modi-to-flag-off-multiple-metro-services-all-you-need-to-know-about-the-project-inaugurations-on-friday/articleshow/123426784.cms", "headline": "Infra boost for West Bengal! PM Modi to flag off multiple metro services on Friday- All you need to know about the project inaugurations", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Narendra Modi is set to inaugurate multiple infrastructure projects in Kolkata and Bihar. In Kolkata, new metro lines will be launched, improving connectivity and reducing travel times. Additionally, a major road project will ease congestion. NEW DELHI: Prime Minister will inaugurate multiple metro projects in Kolkata on Friday (August 22). The PM, during his visit to West Bengal, will flag off a newly built 13.61-km metro corridor with services to be launched on these route. His schedule also includes green-lighting a new subway at Howrah Metro Station and opening of the Noapara–Jai Hind Bimanbandar link to boost airport connectivity. Additionally, the Prime Minister will also flag off the Sealdah–Esplanade metro service and the Beleghata–Hemanta Mukhopadhyay metro service. PM Modi Inaugurates Yellow Line of Bengaluru Metro, Interacts With Commuters He will also undertake a metro ride from Jessore Road Metro Station to Jai Hind Bimanbandar and back, just after the launch, according to ANI report. Travel time on the Sealdah–Esplanade stretch is said to drop from 40 minutes to 11 minutes, while the Beleghata–Hemanta Mukhopadhyay section will provide a key link to the city’s IT hub, with the infrastructural boosts. Officials said the new routes will ease congestion, cut travel time, and benefit hundreds of thousands of daily commuters by linking some of the city's most bustling areas In addition to the metro projects, the Prime Minister will also inaugurate a major road infrastructure project by laying the foundation stone for the 7.2 km six-lane elevated Kona Expressway, valued at over Rs 1,200 crore. This project aims to improve connectivity between Howrah, its surrounding rural areas, and Kolkata, potentially saving hours in travel time and providing a substantial boost to trade, commerce, and tourism in the region. The Prime Minister will also address the public during the event. Before Kolkata, the Prime Minister will be in Gaya, Bihar, where he will unveil projects worth around Rs 13,000 crore. These include the inauguration of the 8.15 km Aunta–Simaria bridge project on the Ganga, constructed at a cost of over Rs 1,870 crore, alongside the four-lane Bakhtiyarpur–Mokama section of NH-31 and improvements to the Bikramganj–Dawath–Nawanagar–Dumraon section of NH-120. He will also inaugurate the Buxar Thermal Power Plant (660x1 MW), enhancing power generation and energy security in the region. In a boost for health and sanitation, PM will inaugurate the Homi Bhabha Cancer Hospital & Research Centre at Muzaffarpur, and a Sewerage Treatment Plant and network at Munger under Namami Gange worth over Rs 520 crore. The Prime Minister will also lay foundation stones for sewerage projects at Daudnagar, Aurangabad, Jehanabad, Barahiya in Lakhisarai, and Jamui, along with water supply projects at Aurangabad, Bodhgaya, and Jehanabad under AMRUT 2.0. To improve connectivity and convenience, he will also flag off two trains—the Amrit Bharat Express between Gaya and Delhi and the Buddhist Circuit Train between Vaishali and Koderma. A Grih Pravesh ceremony for 12,000 beneficiaries under PMAY-Gramin and 4,260 beneficiaries under PMAY-Urban will also be held. Lifestyle Lifestyle auto tv tv Entertainment Entertainment Entertainment Entertainment Entertainment", "summary": "Infrastructure News: Prime Minister Narendra Modi is set to inaugurate multiple infrastructure projects in Kolkata and Bihar. In Kolkata, new metro lines will be launched,", "author": "TOI Business Desk", "date_published": "Updated: Aug 22, 2025, 15:20 IST", "keywords": "Narendra Modi,Kolkata Metro Projects,Howrah Metro Station,Sealdah–Esplanade metro service,Bihar projects,Narendra,PM kolkata visit", "image_url": "https://static.toiimg.com/thumb/msid-123427597,imgsize-1709505,width-400,resizemode-4/123427597.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:21.707413", "word_count": 507, "read_time": 3, "date_machine": "Updated: Aug 22, 2025, 15:20 IST", "tags": ["Narendra Modi", "Kolkata Metro Projects", "Howrah Metro Station", "Sealdah–Esplanade metro service", "Bihar projects", "Narendra", "PM kolkata visit"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/pm-modi-inaugurate-kolkata-metro-projects-today-routes-cost-airport-link-commuter-benefits-10-things-to-know/articleshow/123450865.cms", "headline": "PM Modi to inaugurate Kolkata metro projects today: Routes, cost, airport link, commuter benefits – 10 things to know", "content": "Trending / TIMESOFINDIA.COM / Kolkata is poised for a major infrastructural upgrade as Prime Minister Modi inaugurates new metro lines and lays the foundation for an expressway. These projects will significantly reduce travel times, directly connect the city to the airport for the first time in decades, and enhance connectivity between key railway hubs. Kolkata is set for a significant infrastructural transformation in decades, with Prime Minister inaugurating three metro stretches and laying the foundation stone for a major expressway project on Friday. The developments are expected to ease traffic congestion, cut travel time, and strengthen connectivity between key hubs, including the airport. PM Modi Inaugurates Yellow Line of Bengaluru Metro, Interacts With Commuters Here are 10 key things to know about the infrastructural boost set for Friday afternoon 1. – PM Modi will inaugurate 13.61 km of new metro stretches, marking one of the biggest single-day additions to Kolkata’s urban transport. 2. – The Noapara–Jai Hind Bimanbandar (Yellow Line) will directly connect the city to Netaji Subhas Chandra Bose International Airport for the first time in 41 years. 3. – The new lines will cut a 50-minute road journey to just 11 minutes, while the airport commute from Esplanade will drop to around 30 minutes. 4. – The Sealdah–Esplanade extension (2.45 km) will connect the city’s two busiest railway hubs, Howrah and Sealdah, transforming passenger movement. 5. – The Hemanta Mukhopadhyay–Beleghata (4.4 km) stretch will link Science City, hospitals, schools, and IT corridors, boosting east-south city transit. 6. – Together, the three new corridors will add 366 train services daily, increasing capacity to 9.15 lakh passengers per day. 7. – A single metro smart card will work across all routes, making travel seamless for passengers switching lines. 8. – Stations will feature wider concourses, elevators, escalators, toilets, divyang-friendly amenities, and real-time information systems. 9. – The Jai Hind Bimanbandar terminal is fully underground with direct access to the airport, while Jessore Road station has been built at ground level. 10. – Officials say the projects will ease road congestion, enhance multimodal connectivity, and provide a major boost to commerce, tourism, and airport-linked economic activity. Entertainment Lifestyle tv tv tv Lifestyle Entertainment Lifestyle Lifestyle Lifestyle", "summary": "Infrastructure News: Kolkata is poised for a major infrastructural upgrade as Prime Minister Modi inaugurates new metro lines and lays the foundation for an expressway. Th", "author": "TOI Business Desk", "date_published": "Updated: Aug 23, 2025, 22:48 IST", "keywords": "Kolkata infrastructure transformation,Kolkata metro expansion,Narendra Modi,subhas chandra bose,Prime Minister Modi Kolkata,Netaji Subhas Chandra Bose International Airport,Kolkata expressway project,Kolkata travel time reduction", "image_url": "https://static.toiimg.com/thumb/msid-123451054,imgsize-1655202,width-400,resizemode-4/123451054.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:23.078399", "word_count": 365, "read_time": 2, "date_machine": "Updated: Aug 23, 2025, 22:48 IST", "tags": ["Kolkata infrastructure transformation", "Kolkata metro expansion", "Narendra Modi", "subhas chandra bose", "Prime Minister Modi Kolkata", "Netaji Subhas Chandra Bose International Airport", "Kolkata expressway project", "Kolkata travel time reduction"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/gujarats-rs-2548-crore-urban-makeover-ahmedabad-and-gandhinagar-to-see-upgraded-roads-six-lane-expressway-pm-modi-to-inaugurate-lay-foundation-stones/articleshow/123469162.cms", "headline": "Gujarat's Rs 2,548 crore urban makeover: Ahmedabad and Gandhinagar to see upgraded roads, six-lane expressway; PM Modi to inaugurate, lay foundation stones", "content": "Trending / TIMESOFINDIA.COM / NEW DELHI: Prime Minister will inaugurate and lay the foundation stones for urban development projects worth Rs 2,548 crore in Ahmedabad and Gandhinagar on Monday and Tuesday. The initiative coincides with Gujarat celebrating the Urban Development Year and marks 20 years of the state’s urban development journey initiated by Modi as chief minister, said a press release Saturday. In Ahmedabad, projects worth Rs 2,267 crore will be inaugurated: In Gandhinagar, PM Modi will inaugurate projects worth Rs 281 crore, including: These projects aim to enhance urban infrastructure, improve ease of living, and strengthen the metropolitan outlook of Ahmedabad and Gandhinagar, supporting Gujarat’s continued urban development. Lifestyle Lifestyle Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment tv", "summary": "Infrastructure News: NEW DELHI: Prime Minister Narendra Modi will inaugurate and lay the foundation stones for urban development projects worth Rs 2,548 crore in Ahmedabad.", "author": "TOI Business Desk", "date_published": "Aug 23, 2025, 14:51 IST", "keywords": "Gujarat urban development,urban makeover projects,clean drinking water projects,Prime Minister Modi inauguration,Narendra Modi,Ahmedabad Gandhinagar infrastructure,slum rehabilitation Ahmedabad,sanitation and drainage improvements Gandhinagar,PM Awas Yojana", "image_url": "https://static.toiimg.com/thumb/msid-123469211,imgsize-984841,width-400,resizemode-4/123469211.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:24.395268", "word_count": 119, "read_time": 1, "date_machine": "Aug 23, 2025, 14:51 IST", "tags": ["Gujarat urban development", "urban makeover projects", "clean drinking water projects", "Prime Minister Modi inauguration", "Narendra Modi", "Ahmedabad Gandhinagar infrastructure", "slum rehabilitation Ahmedabad", "sanitation and drainage improvements Gandhinagar", "PM Awas Yojana"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/delhi-metro-fare-hike-dmrc-raises-prices-starting-today-check-kilometre-wise-list-of-new-rates/articleshow/123500258.cms", "headline": "Delhi Metro fare hike: DMRC raises prices starting today; check kilometre-wise list of new rates", "content": "Trending / TIMESOFINDIA.COM / Delhi Metro fares have increased for the first time in years, impacting daily commuters. Effective Monday, fares are up by Rs 1 to Rs 4, with the minimum fare now Rs 11 and the highest Rs 64. Airport Express Line fares also see a rise. The DMRC calls the revision minimal but necessary to balance operational costs. Travel in Delhi Metro? Metro rides have become a little costlier for you. The Delhi Metro Rail Corporation (DMRC) has revised passenger fares for the first time in years, with increases ranging from Rs 1 to Rs 4 depending on the distance travelled, while the Airport Express Line has also seen a hike of up to Rs 5. According to the new structure, effective from Monday, the minimum fare on normal days has gone up from Rs 10 to Rs 11 for journeys up to 2 km. The highest fare for trips beyond 32 km now stands at Rs 64, up from Rs 60. Here is how much more you will have to pay aboard the Delhi metro: For mid-range journeys, fares between 12–21 km have been raised from Rs 40 to Rs 43, while traveling 21–32 km will now cost Rs 54 compared to Rs 50 earlier. These revisions also apply on Sundays and national holidays. Trips beyond 32 km on such days, which previously cost Rs 50, will now cost Rs 54, while the 12–21 km slab has increased to Rs 32 from Rs 30. A similar rise has also been introduced on the Airport Express Line, where the increase varies between Rs 1 and Rs 5. The DMRC described the revision as \"minimal\" and said the step was crucial \"to balance operational costs while continuing to provide affordable public transport.\" Smart Card users will, however, continue to receive a 10 per cent discount, along with an additional 10 per cent rebate during off-peak hours. tv Entertainment Lifestyle auto Entertainment Lifestyle tv Entertainment Lifestyle Lifestyle", "summary": "Infrastructure News: Delhi Metro fares have increased for the first time in years, impacting daily commuters. Effective Monday, fares are up by Rs 1 to Rs 4, with the mini", "author": "TOI Business Desk", "date_published": "Updated: Aug 26, 2025, 11:33 IST", "keywords": "Delhi Metro fare increase,DMRC fare revision 2023,Delhi Metro fare structure,Airport Express Line fare hike,Metro fare changes 2023", "image_url": "https://static.toiimg.com/thumb/msid-123500981,imgsize-1630363,width-400,resizemode-4/123500981.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:25.495768", "word_count": 328, "read_time": 2, "date_machine": "Updated: Aug 26, 2025, 11:33 IST", "tags": ["Delhi Metro fare increase", "DMRC fare revision 2023", "Delhi Metro fare structure", "Airport Express Line fare hike", "Metro fare changes 2023"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/centre-to-restart-seaplane-services-by-october-two-routes-planned-initially-with-simplified-guidelines-says-aviation-minister-naidu/articleshow/123502748.cms", "headline": "Centre to restart seaplane services by October: Two routes planned initially with simplified guidelines, says aviation minister Naidu", "content": "Trending / TIMESOFINDIA.COM / Union Civil Aviation Minister Ram Mohan Naidu announced the revival of seaplane services in India, expected to commence by October on at least two routes. Simplified guidelines aim to encourage operations in areas like Andaman & Nicobar, Kerala, or Andhra Pradesh. The service, potentially extending to Odisha's Chilika Lake, requires minimal water depth and landing space. Union civil aviation minister Ram Mohan Naidu announced on Monday that the civil aviation ministry is set to revive seaplane services in India by October, with operations expected to begin on at least two routes. \"Seaplane operation was there once, but it was limited to a single route. The government has simplified the guidelines to operate seaplanes, and we hope that by October, we will have two seaplanes in the country operating either on the Andaman & Nicobar, Kerala, or Andhra Pradesh network,\" Naidu said while addressing the Eastern Region Civil Aviation Ministers’ Conference. The conference was inaugurated by Odisha chief minister Mohan Charan Majhi in the presence of Union MoS civil aviation Mohol Murlidhar, Chhattisgarh minister Om Prakash Choudhary, and senior officials from the Centre and eastern states. The service may also be extended to Odisha’s Chilika Lake and other parts of the eastern coast, the minister said. \"The service can be started on any water body where you have more than five feet depth and 200 metres of landing space,\" he added. The minister also called on states to propose innovative ideas and identify new locations to help expand the seaplane network. He highlighted that the government has simplified norms for setting up waterdromes, pilot training, and operational regulations to encourage airlines to explore the opportunity. On the growing demand for pilots, Naidu said that India’s education sector will require nearly 3,000 new pilots every year, given the 1,700 aircraft currently on order. \"To achieve this, the Ministry will start a ranking system for FTOs operating in India from October,\" Naidu said. The Union government has brought seaplane services under the UDAN (Ude Desh ka Aam Nagrik) scheme and identified around 56 potential routes for their launch. Entertainment Lifestyle Entertainment Lifestyle astrology Lifestyle auto tv Entertainment astrology", "summary": "Infrastructure News: Union Civil Aviation Minister Ram Mohan Naidu announced the revival of seaplane services in India, expected to commence by October on at least two rou", "author": "TOI Business Desk", "date_published": "Aug 25, 2025, 17:06 IST", "keywords": "seaplane services,revival of seaplane services in India,aviation minister Naidu,UDAN scheme,new routes for seaplanes,Indian civil aviation,aircraft pilot demand,waterdromes,Chilika Lake seaplane,seaplane operations", "image_url": "https://static.toiimg.com/thumb/msid-123502886,imgsize-1143514,width-400,resizemode-4/123502886.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:26.648700", "word_count": 359, "read_time": 2, "date_machine": "Aug 25, 2025, 17:06 IST", "tags": ["seaplane services", "revival of seaplane services in India", "aviation minister Naidu", "UDAN scheme", "new routes for seaplanes", "Indian civil aviation", "aircraft pilot demand", "waterdromes", "Chilika Lake seaplane", "seaplane operations"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/indias-green-mobility-push-pm-modi-flags-off-marutis-made-in-india-ev-to-be-exported-to-over-100-countries-top-points-about-e-vitara-project/articleshow/123518147.cms", "headline": "India's green mobility push: PM Modi flags off Maruti’s 'made-in-India' EV, to be exported to over 100 countries– top points about 'e-Vitara' project", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Modi inaugurated Maruti Suzuki's first made-in-India Battery Electric Vehicle, the e-Vitara, in Gujarat, destined for export to over 100 countries. This launch, coinciding with the start of hybrid battery electrode production, signifies India's growing strength in green mobility. NEW DELHI: Prime Minister on Tuesday flagged off ’s first Battery Electric Vehicle (BEV), e-Vitara, at Hansalpur, Gujarat. The EV, made in India, will be exported to over 100 countries, signifying India’s growing ambitions in green mobility and self-reliance. The launch coincided with the commencement of hybrid battery electrode production at a new plant in Hansalpur, giving a boost to India’s EV battery ecosystem. PM Modi hailed the day as a milestone in India’s journey towards becoming a hub for sustainable transportation. First showcased at the Bharat Mobility Global Expo in New Delhi earlier this year, the e-Vitara is Maruti Suzuki’s debut EV and marks the company’s global push in the electric segment. Here's a quick insight into what the project is all about: In a further push for EVs PM also also inaugurated a lithium-ion battery manufacturing facility set up by Suzuki, Toshiba and Denso to support production of batteries for hybrid and electric vehicles. Meanwhile, on Monday, he also laid the foundation stone and dedicated to the nation multiple development projects worth Rs 5,400 crores at Khodaldham ground in Ahmedabad. Lifestyle tv Lifestyle Lifestyle Lifestyle Lifestyle Lifestyle Lifestyle tv Entertainment", "summary": "Infrastructure News: Prime Minister Modi inaugurated Maruti Suzuki's first made-in-India Battery Electric Vehicle, the e-Vitara, in Gujarat, destined for export to over 10", "author": "TOI Business Desk", "date_published": "Updated: Aug 26, 2025, 14:12 IST", "keywords": "Maruti Suzuki,e-Vitara,electric vehicle,India green mobility,Battery Electric Vehicle,EV exports,EV market in India,Narendra Modi", "image_url": "https://static.toiimg.com/photo/63379366.cms", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:27.977026", "word_count": 236, "read_time": 1, "date_machine": "Updated: Aug 26, 2025, 14:12 IST", "tags": ["Maruti Suzuki", "e-Vitara", "electric vehicle", "India green mobility", "Battery Electric Vehicle", "EV exports", "EV market in India", "Narendra Modi"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/china-huajiang-grand-canyon-bridge-set-to-be-worlds-tallest-passes-load-test-96-trucks-pass-on-safely-report/articleshow/123543307.cms", "headline": "China's Huajiang Grand Canyon Bridge, set to be world's tallest, passes load test; 96 trucks pass on safely: Report", "content": "Trending / TIMESOFINDIA.COM / The Huajiang Grand Canyon Bridge in China has passed its final load test and is set to become the world's tallest bridge. Spanning 625 meters above the Beipan River, it will drastically reduce travel time across the canyon from two hours to just two minutes. The newly constructed Huajiang Grand Canyon Bridge in Southwest China has cleared its final load test and is on track to become the world’s tallest bridge, connecting previously isolated regions in Guizhou province, as reported by local newspaper China Daily. Spanning the Beipan River gorge in Huajiang town, the bridge crosses limestone cliffs formed from ancient Triassic seas, historically making human passage impossible. The total length of the bridge is 2,890 metres, with a central span of 1,420 metres. At 625 metres above the water, it will claim the title of the world’s highest bridge. The final load test, conducted on Monday, included 96 heavy trucks weighing a total of 3,300 tonnes. Over 400 sensors monitored the bridge’s structural response, measuring minute movements in the main span, towers, cables, and suspenders. After five days of testing, the bridge met all safety requirements for structural strength, stiffness, and dynamic performance. Traffic is expected to begin in late September. The load test is considered the final step before the bridge welcomes traffic. “This bridge is an unprecedented engineering feat,” said Wu Zhaoming of Guizhou Transportation Investment Group Co., Ltd., noting the challenges of temperature control during concrete pouring, slope stabilisation in steep terrain, and strong winds, as quoted by China Daily. Construction began in January 2022, with the main span completed this year. The bridge will slash travel times across the canyon from two hours to just two minutes, serving as a vital expressway link in Guizhou’s effort to modernise its interior transport network. Guizhou, China’s only province without plains, has long relied on bridges and tunnels to navigate its rugged karst terrain. The province now contains over 30,000 bridges, including three of the world’s highest. Nearly half of the 100 tallest bridges globally are in Guizhou, earning it the nickname “the world’s bridge museum.” The total length of bridges in the province, including those under construction, exceeds 5,400 kilometres—roughly the distance from north to south China. Lifestyle Lifestyle Lifestyle Lifestyle Entertainment tv Lifestyle Lifestyle Entertainment Lifestyle", "summary": "Infrastructure News: The Huajiang Grand Canyon Bridge in China has passed its final load test and is set to become the world's tallest bridge. Spanning 625 meters above th", "author": "TOI Business Desk", "date_published": "Aug 27, 2025, 16:07 IST", "keywords": "Huajiang Grand Canyon Bridge,world’s tallest bridge,Guizhou province,infrastructure development in China,bridge construction,bridges in Guizhou", "image_url": "https://static.toiimg.com/thumb/msid-123544326,imgsize-1496012,width-400,resizemode-4/123544326.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:28.769676", "word_count": 384, "read_time": 2, "date_machine": "Aug 27, 2025, 16:07 IST", "tags": ["Huajiang Grand Canyon Bridge", "world’s tallest bridge", "Guizhou province", "infrastructure development in China", "bridge construction", "bridges in Guizhou"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/building-resilient-highways-india-drives-safer-roads-with-data-led-platforms-ai-project-iraste-shows-early-gains/articleshow/123716860.cms", "headline": "Building resilient highways: India drives safer roads with data-led platforms; AI project iRASTE shows early gains", "content": "Trending / TIMESOFINDIA.COM / India is actively building a safer road network by implementing technology-driven platforms like the Integrated Road Accident Database (iRAD) across all states and union territories. This centralised platform facilitates real-time accident data collection and analysis, enabling evidence-based interventions to reduce accidents. The adoption of digital platforms and intelligent technologies is laying the foundation for a more resilient road network. India is strengthening efforts to build a safer and more resilient road network by deploying technology-enabled, data-driven platforms such as the Integrated Road Accident Database (iRAD), according to a report released by FICCI and Crisil. The report highlighted that iRAD, developed by the National Informatics Centre (NIC), has been implemented nationwide across all 36 states and union territories. Serving as a centralised platform, it facilitates real-time accident data collection and analysis by integrating inputs from multiple stakeholders. “India is taking a major leap towards a data-driven, technology-enabled road safety ecosystem in India, fostering safer roads for all,” the report stated, as per news agency ANI. PM Modi Flags Off Two Highways To Curb Congestion In Delhi-NCR By enabling evidence-based interventions, iRAD helps identify black spots, improve accident-prone areas, streamline insurance claim processing and support cashless treatment for victims. The report stressed that such measures are helping the country foster a robust technology-driven road safety ecosystem. The study also underlined that state governments can further enhance safety by developing comprehensive Road Safety Action Plans (RSAPs). These plans would serve as strategic roadmaps for prioritising safety improvements and allow states to access dedicated funding. “State governments have a significant opportunity to enhance road safety by developing a comprehensive Road Safety Action Plan (RSAP),” it noted. According to ministry of road transport and highways (MoRTH) data, India reported 4.80 lakh accidents in 2023, leading to 1.73 lakh fatalities and 4.62 lakh injuries. This translates to nearly 20 deaths every hour. The report also pointed to technology-led projects such as the Intelligent Solutions for Road Safety through Technology and Engineering (iRASTE). Launched in Nagpur and Telangana by the Central Road Research Institute, the project combines artificial intelligence, sensors, and real-time mobility analytics to prevent crashes. With a target of reducing accidents in Nagpur by 50 per cent, early results have shown promising reductions in high-risk driving events. The FICCI-Crisil study concluded that India’s adoption of digital platforms and intelligent technologies is laying the foundation for a safer and more resilient road network. Lifestyle Lifestyle Lifestyle tv astrology Entertainment tv Lifestyle Entertainment Entertainment", "summary": "Infrastructure News: India is actively building a safer road network by implementing technology-driven platforms like the Integrated Road Accident Database (iRAD) across a", "author": "TOI Business Desk", "date_published": "Updated: Sep 05, 2025, 17:25 IST", "keywords": "India road safety,Road Safety Action Plans (RSAP),FICCI Crisil report,technology-enabled road network,accident data collection,road transport and highways ministry,black spots identification,real-time mobility analytics,National Informatics Centre (NIC)", "image_url": "https://static.toiimg.com/thumb/msid-123717256,imgsize-293045,width-400,resizemode-4/future-indian-city-seamless-urban-mobility.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:30.087490", "word_count": 411, "read_time": 2, "date_machine": "Updated: Sep 05, 2025, 17:25 IST", "tags": ["India road safety", "Road Safety Action Plans (RSAP)", "FICCI Crisil report", "technology-enabled road network", "accident data collection", "road transport and highways ministry", "black spots identification", "real-time mobility analytics", "National Informatics Centre (NIC)"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/bihar-infra-boost-cabinet-clears-4-lane-mokamamunger-road-corridor-rs-4447-crore-allocated/articleshow/123806369.cms", "headline": "Bihar infra boost: Cabinet clears 4-lane Mokama–Munger road corridor; Rs 4,447 crore allocated", "content": "Trending / TIMESOFINDIA.COM / The CCEA has approved the construction of a 4-lane greenfield access-controlled Mokama–Munger section of the Buxar–Bhagalpur high-speed corridor in Bihar, costing Rs 4,447.38 crore. This 82.4 km project, built on Hybrid Annuity Mode, will reduce travel time to 1.5 hours and boost industrial activity in eastern Bihar, generating significant employment opportunities. The Cabinet Committee on Economic Affairs (CCEA) has approved the construction of a 4-lane greenfield access-controlled Mokama–Munger section of the Buxar–Bhagalpur high-speed corridor in Bihar. The project will be taken up on Hybrid Annuity Mode (HAM), covering 82.4 km at a total capital cost of Rs 4,447.38 crore, the Ministry of Road Transport & Highways said in a statement. “The corridor, designed for speeds of up to 100 km/h, will cut overall travel time to about 1.5 hours while offering safer, faster and uninterrupted connectivity for both passenger and freight vehicles,” the ministry said. The Mokama–Munger link will connect key towns such as Barahiya, Lakhisarai, Jamalpur and Munger, while providing onward connectivity to Bhagalpur. The project is expected to accelerate industrial activity in eastern Bihar, with the Munger–Jamalpur–Bhagalpur belt emerging as an economic hub. “The region is developing with a defence ordnance factory, locomotive workshops, food processing centres, textile clusters and logistics hubs. Increased industrial activity will drive freight movement on the new section,” the statement added. The ministry said the project will generate an estimated 14.83 lakh man-days of direct employment and 18.46 lakh man-days of indirect employment. “The corridor will also induce additional job opportunities owing to increased economic activity in the vicinity,” it added. Lifestyle Lifestyle Lifestyle Entertainment tv Entertainment Entertainment Entertainment Entertainment auto", "summary": "Infrastructure News: The CCEA has approved the construction of a 4-lane greenfield access-controlled Mokama–Munger section of the Buxar–Bhagalpur high-speed corridor in Bi", "author": "TOI Business Desk", "date_published": "Updated: Sep 10, 2025, 15:36 IST", "keywords": "Mokama–Munger road corridor,Bihar infrastructure,4-lane highway,high-speed corridor,Hybrid Annuity Mode", "image_url": "https://static.toiimg.com/thumb/msid-123806396,imgsize-886046,width-400,resizemode-4/-.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:31.390144", "word_count": 272, "read_time": 1, "date_machine": "Updated: Sep 10, 2025, 15:36 IST", "tags": ["Mokama–Munger road corridor", "Bihar infrastructure", "4-lane highway", "high-speed corridor", "Hybrid Annuity Mode"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/bhagalpurdumkarampurhat-railways-line-to-be-doubled-rs-3169-crore-project-greenlit-by-cabinet-freight-tourism-to-benefit/articleshow/123806166.cms", "headline": "Bhagalpur–Dumka–Rampurhat railways line to be doubled: Rs 3,169 crore project greenlit; freight, tourism to benefit", "content": "Trending / TIMESOFINDIA.COM / The Cabinet Committee has approved the doubling of the Bhagalpur–Dumka–Rampurhat railway line, a 177 km project spanning Bihar, Jharkhand, and West Bengal, with an estimated cost of Rs 3,169 crore. This initiative aims to enhance mobility, reduce congestion, and boost infrastructural development, benefiting approximately 28.72 lakh people across five districts and supporting an additional 15 MTPA of cargo. NEW DELHI: The Cabinet Committee on Economic Affairs, chaired by on Tuesday approved the doubling of the Bhagalpur–Dumka–Rampurhat railway line, covering a distance of 177 km across Bihar, Jharkhand, and West Bengal. The project is estimated to cost approximately Rs 3,169 crore. \"The enhanced line capacity will improve mobility, providing enhanced efficiency and service reliability for . The multi-tracking proposal will ease operations and reduce congestion, providing the much-required infrastructural development on the busiest sections across Indian Railways. The projects are in line with the Prime Minister Shri Narendra Modiji’s vision of a New India which will make people of the region “Atmanirbhar” by way of comprehensive development in the area which will enhance their employment/ self-employment opportunities,\" stated the government press release. The line will connect five districts across three states, providing improved rail access to prominent religious and tourist destinations such as Deoghar (Baba Baidyanath Dham) and Tarapith (Shakti Peeth). Approximately 441 villages and 28.72 lakh people, including residents of three Aspirational Districts—Banka, Godda, and Dumka—will benefit from the project. From a freight perspective, the doubling of the line is expected to support an additional 15 million tonnes per annum (MTPA) of cargo, including coal, cement, fertilizers, bricks, and stones. The Railways’ environmentally friendly transport mode is projected to help reduce oil imports by five crore litres and cut CO2 emissions by 24 crore kg, equivalent to the plantation of one crore trees. Officials emphasized that the project would not only enhance mobility and connectivity but also strengthen the economic and cultural significance of the region. In another infrastructural development, the Cabinet also approved the construction of a 4-lane greenfield, access-controlled Mokama–Munger section of the Buxar–Bhagalpur High-Speed Corridor in Bihar under the Hybrid Annuity Mode (HAM), covering 82.4 km with a total capital cost of Rs 4,447.38 crore. Lifestyle tv Lifestyle Entertainment Entertainment Lifestyle tv Entertainment Lifestyle tv", "summary": "Infrastructure News: The Cabinet Committee has approved the doubling of the Bhagalpur–Dumka–Rampurhat railway line, a 177 km project spanning Bihar, Jharkhand, and West Be", "author": "TOI Business Desk", "date_published": "Sep 10, 2025, 15:39 IST", "keywords": "Bhagalpur-Dumka-Rampurhat railway line,Narendra Modi,Indian Railways,Prime Minister Narendra Modi,Bihar Jharkhand West Bengal,infrastructure development", "image_url": "https://static.toiimg.com/thumb/msid-123806595,imgsize-685187,width-400,resizemode-4/article-22.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:32.470887", "word_count": 372, "read_time": 2, "date_machine": "Sep 10, 2025, 15:39 IST", "tags": ["Bhagalpur-Dumka-Rampurhat railway line", "Narendra Modi", "Indian Railways", "Prime Minister Narendra Modi", "Bihar Jharkhand West Bengal", "infrastructure development"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/mizorams-first-railway-line-pm-modi-inaugurates-rs-8070-crore-worth-bairabisairang-project-rajdhani-flagged-off-to-link-aizawl-with-national-network/articleshow/123864448.cms", "headline": "Mizoram's first railway line: PM Modi inaugurates Rs 8,070 crore worth Bairabi–Sairang project; Rajdhani flagged off to link Aizawl with national network", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Narendra Modi inaugurated Mizoram's first railway line, the Bairabi–Sairang broad-gauge project, a significant boost to the state's connectivity. The project, costing Rs 8,070 crore, features complex engineering, including numerous tunnels and bridges. This new line directly links Aizawl with the Indian railway network, enhancing logistics, tourism, and daily life for residents. Prime Minister on Saturday inaugurated Mizoram’s first-ever railway line, the Bairabi–Sairang broad-gauge project, marking a historic moment in the state’s connectivity journey. Built at a cost of Rs 8,070 crore, the 51.38-km line is being regarded as one of the most complex undertakings in ’ history. PM Modi Says BJP Reversed Congress Neglect As Mizoram Emerges Key To India’s Act East Policy Sanctioned in 2008-09 and launched for construction in 2015, the line features 45 tunnels, 55 major bridges, 87 minor bridges and ten road over- and underpasses. Nearly 54% of the alignment passes through tunnels and bridges. Among its most striking structures is Bridge No. 144 near Sairang, which at 114 metres stands taller than Delhi’s Qutub Minar, making it the tallest pier railway bridge in the country, according to the Northeast Frontier Railway. The project also added four stations — Hortoki, Kawnpui, Mualkhang and Sairang — connecting communities along the route. The new route extends connectivity from Bairabi on the Assam–Mizoram border to Sairang, just 20 km from Aizawl, directly linking the state capital with India’s railway network for the first time. With this, Aizawl becomes the fourth northeastern capital to gain direct rail access, after Assam's Guwahati, Tripura's Agartala and Arunachal Pradesh's Itanagar. The Prime Minister also flagged off three new long-distance services: the Sairang–Delhi Rajdhani Express, the Sairang–Guwahati Express, and the Sairang–Kolkata Express. According to Indian Railways, the inaugural Rajdhani left Sairang at 10 am on Saturday to reach Anand Vihar Terminal on September 15. Regular services will see the train depart Sairang every Friday evening and return from Delhi every Sunday night. The Guwahati Express will run daily from September 13, departing Guwahati at 7 pm and Sairang at 7 pm the next day. The Kolkata Express will operate thrice weekly, leaving Kolkata every Saturday, Tuesday and Wednesday and returning from Sairang every Monday, Thursday and Friday. The Prime Minister’s Office said the line would provide “safe, efficient and cost-effective travel options,” while ensuring timely supplies of essentials like food grains and fertilisers, as per news agency PTI. Railway minister Ashwini Vaishnaw underlined that the project had to overcome “Himalayan geology and complex terrain,” noting that engineers even had to solidify loose sand into rock formations before tunnelling could proceed. Alongside the rail project, the Prime Minister laid foundation stones for a range of infrastructure works worth over Rs 9,000 crore. These include the 45-km Aizawl Bypass Road under PM-DevINE, the Thenzawl–Sialsuk Road and the Khankawn–Rongura Road under NESIDS, aimed at easing travel and improving access for farmers and traders. The Thenzawl–Sialsuk Road is expected to benefit horticulture farmers, dragon fruit growers, paddy cultivators and ginger processors, while the Khankawn–Rongura Road will support market access and a planned ginger processing plant (PTI). The Prime Minister also launched projects such as the Chhimtuipui bridge, which will provide all-weather connectivity and support cross-border commerce under the Kaladan Multimodal Transit framework. Other projects include an LPG bottling plant at Mualkhang, new sports infrastructure, and residential schools under PMJVK and the Eklavya Model scheme. Officials said the Bairabi–Sairang railway is expected to transform logistics and tourism, reduce travel time and generate employment. “This project has been constructed under great challenges,” Vaishnaw said, adding that it was a major step in implementing the government’s Act East Policy. Entertainment Entertainment Entertainment Entertainment Lifestyle Lifestyle Lifestyle Lifestyle tv tv", "summary": "Infrastructure News: Prime Minister Narendra Modi inaugurated Mizoram's first railway line, the Bairabi–Sairang broad-gauge project, a significant boost to the state's con", "author": "TOI Business Desk", "date_published": "Updated: Sep 14, 2025, 10:41 IST", "keywords": "Mizoram railway line,Narendra Modi,Indian Railways,Bairabi Sairang project,Aizawl railway connection,Northeast India,railway infrastructure,Sairang Express,Aizawl Bypass Road,Prime Minister's Office", "image_url": "https://static.toiimg.com/thumb/msid-123878597,imgsize-1230098,width-400,resizemode-4/untitled-design-20.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:33.298998", "word_count": 614, "read_time": 3, "date_machine": "Updated: Sep 14, 2025, 10:41 IST", "tags": ["Mizoram railway line", "Narendra Modi", "Indian Railways", "Bairabi Sairang project", "Aizawl railway connection", "Northeast India", "railway infrastructure", "Sairang Express", "Aizawl Bypass Road", "Prime Minister's Office"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/rail-connectivity-boost-for-bihar-4-new-trains-flagged-off-by-pm-modi-check-details-on-new-vande-bharat-amrit-bharat-and-more/articleshow/123919915.cms", "headline": "Rail connectivity boost for Bihar! 4 new trains flagged off by PM Modi - Check details on new Vande Bharat, Amrit Bharat & more", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Modi launched several railway projects in Bihar, including new trains and rail lines, via video conferencing. These initiatives aim to enhance regional connectivity, reduce travel time, and promote economic and social integration across the state. The projects include the Vande Bharat Express, Amrit Bharat Express trains, and the inauguration of the Araria–Galgalia rail line. NEW DELHI: Prime Minister on Monday flagged off four new trains, inaugurated a newly built railway line, and laid the foundation stone for a major new rail-cum-bridge project in Bihar via video conferencing. The initiatives aim to strengthen regional connectivity, reduce travel time, and boost economic, cultural, and social integration across the state. The trains flagged off include: Officials highlighted that the Saharsa–Chheharta train will benefit passengers travelling to Punjab, while the Jogbani–Danapur Vande Bharat Express will connect northeastern Bihar to Patna in just over 8 hours, passing through key districts such as Araria, Purnea, Saharsa, Samastipur, and Muzaffarpur. The trains feature modern interiors, improved facilities, and faster travel capabilities. Khada Ho!’ Bihar CM Nitish Kumar Orders Crowd to Stand and Applaud PM Modi PM Modi also inaugurated the 111 km Araria–Galgalia (Thakurganj) rail line, a crucial corridor near the India–Nepal border built at a cost of Rs 4,412 crore. He laid the foundation stone for the 26 km Vikramshila–Kataria rail line-cum-bridge in Bhagalpur, estimated at Rs 2,171 crore. These projects aim to ease congestion and improve east-west rail connectivity in Bihar. The new trains and rail lines are expected to boost economic activity, enhance mobility, and strengthen cultural and social integration across northern Bihar. Officials said the projects mostly fall under the Katihar division of Northeast Frontier Railway, highlighting the government’s focus on improving infrastructure in strategic regions. Lifestyle tv Entertainment Entertainment Lifestyle tv Entertainment Lifestyle tv tv", "summary": "Infrastructure News: Prime Minister Modi launched several railway projects in Bihar, including new trains and rail lines, via video conferencing. These initiatives aim to", "author": "TOI Business Desk", "date_published": "Updated: Sep 17, 2025, 11:59 IST", "keywords": "Northeast Frontier Railway,Bihar railway projects,Vande Bharat Express,Narendra Modi,railway connectivity", "image_url": "https://static.toiimg.com/thumb/msid-123920222,imgsize-1473113,width-400,resizemode-4/article-58.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:34.525950", "word_count": 299, "read_time": 1, "date_machine": "Updated: Sep 17, 2025, 11:59 IST", "tags": ["Northeast Frontier Railway", "Bihar railway projects", "Vande Bharat Express", "Narendra Modi", "railway connectivity"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/bihar-infrastructure-boost-rs-3822-cr-four-lane-section-of-sahebganj-bettiah-nh-139w-approved-check-benefits/articleshow/124089651.cms", "headline": "Bihar infrastructure boost: Rs 3,822-cr four-lane section of Sahebganj-Bettiah NH-139W approved; check benefits", "content": "Trending / TIMESOFINDIA.COM / The Union Cabinet on Wednesday approved the construction of the four-lane Sahebganj-Areraj-Bettiah section of NH-139W in Bihar under the Hybrid Annuity Mode (HAM) at an estimated cost of Rs 3,822.31 crore. Spanning 78.942 km, the project will improve connectivity between Patna and Bettiah and link key north Bihar districts, including Vaishali, Saran, Siwan, Gopalganj, Muzaffarpur, East Champaran, and West Champaran, extending up to the Indo-Nepal border. \"The Cabinet Committee on Economic Affairs, chaired by Prime Minister Narendra Modi, has today approved the construction of the four-lane Sahebganj-Areraj-Bettiah section of the NH-139W in Bihar on Hybrid Annuity Mode (HAM) with a total project length of 78.942 km and total capital cost of Rs 3,822.31 crore,\" an official statement said. The greenfield highway is designed for speeds of up to 100 km/h with an average speed of 80 km/h, reducing travel time between Sahebganj and Bettiah from 2.5 hours to just one hour. It will provide safe, fast, and uninterrupted connectivity for both passenger and freight traffic, while serving as an alternate route to congested areas. The highway will support long-distance freight movement, improve access to industrial zones, agricultural areas, and cross-border trade routes, and strengthen regional economic development. The project is expected to generate 14.22 lakh man-days of direct employment and 17.69 lakh man-days of indirect employment, with additional opportunities arising from increased economic activity along the corridor. The project will connect seven PM Gati Shakti economic nodes, six social nodes, eight logistic nodes, and nine major tourism and religious centers, including Kesariya Buddha Stupa (Sahebganj), Someshwarnath Mandir (Areraj), Jain Mandir and Vishwa Shanti Stupa (Vaishali), and Mahavir Temple (Patna). This will enhance the Buddhist tourism circuit in Bihar and promote international tourism potential. The Cabinet has also approved the doubling of the 104-km Bakhtiyarpur–Rajgir–Tilaiya railway section in Bihar at a total cost of Rs 2,192 crore. Covering four districts, the project will expand the Indian Railways network in the state by an additional 104 km. tv Lifestyle Entertainment Lifestyle Lifestyle tv auto Entertainment Entertainment Lifestyle", "summary": "Infrastructure News: The Union Cabinet on Wednesday approved the construction of the four-lane Sahebganj-Areraj-Bettiah section of NH-139W in Bihar under the Hybrid Annuit.", "author": "TOI Business Desk", "date_published": "Updated: Sep 24, 2025, 16:17 IST", "keywords": "Bihar infrastructure development,four-lane highway NH-139W,Sahebganj-Bettiah corridor,connectivity improvement Bihar,Bharatmala Pariyojana,travel time reduction Bihar,economic growth Bihar", "image_url": "https://static.toiimg.com/thumb/msid-124089736,imgsize-924504,width-400,resizemode-4/1-59.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:35.656544", "word_count": 339, "read_time": 2, "date_machine": "Updated: Sep 24, 2025, 16:17 IST", "tags": ["Bihar infrastructure development", "four-lane highway NH-139W", "Sahebganj-Bettiah corridor", "connectivity improvement Bihar", "Bharatmala Pariyojana", "travel time reduction Bihar", "economic growth Bihar"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/indias-swadeshi-milestone-pm-modi-to-launch-bsnls-indigenous-4g-network-commission-97000-mobile-towers-what-we-know/articleshow/124158895.cms", "headline": "India’s ‘swadeshi’ milestone: PM Modi to launch BSNL's indigenous 4G network, commission 97,000 mobile towers— What we know", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Narendra Modi is set to launch BSNL's indigenous 4G network on September 27, positioning India among the select nations manufacturing their own telecom equipment. This initiative involves commissioning over 97,500 mobile 4G towers, with a significant portion utilizing fully indigenized and 5G-upgradable technology. NEW DELHI: Prime Minister Narendra Modi will launch ’s Swadeshi 4G 'network stack' on September 27, making India one of the few countries that manufacture their own telecom equipment, alongside Denmark, Sweden, South Korea, and China. This launch is a major milestone for India’s telecom sector and digital infrastructure. 'Put Swadeshi Boards Outside Shops': PM Modi's Local Push As More US Tariffs Loom | Ahmedabad Communications Minister Jyotiraditya Scindia said over 97,500 mobile 4G towers will be commissioned by the PM at Jharsuguda. Of these, more than 92,600 towers installed by BSNL use fully indigenised 4G technology, which is 5G upgradable. “This is a new era for the telecom sector, an era where India has entered into the domain of top countries, which produce and manufacture telecom equipment, including Denmark, Sweden, South Korea, China...India is now the fifth country. This big change in attitude, change in goals was pushed, pioneered and catalysed by the PM,” Scindia said, as quoted by PTI. In addition to BSNL, Reliance Jio Infocomm and Bharti Airtel have installed over 4,700 4G towers. Under the Digital Bharat Nidhi saturation project, 14,180 towers have been set up to cover 26,700 unconnected villages in remote, border, and left-wing extremism-affected areas. “These towers will serve over two million new subscribers and support e-governance, digital payments, online education, telemedicine, and other citizen-centric applications,” the communications minister said. Scindia highlighted the network’s readiness for future upgrades: \"The India-made network is cloud-based, future-ready and can upgrade seamlessly to 5G. Having perfected 4G, we will be moving towards converting that to 5G as well. Our 4G towers and BTSs are already serving 22 million customers across the length and breadth of our country.\" \"Today is an important day heralding, in 24 hours, the emergence of India on the global telecom footprint, not only as a service provider to 1.2 billion customers...with the cheapest call rates and the cheapest data rate at 11 cents/GB in the world, but also tomorrow will be the day when the world will awake to India having arrived not only as a service provider, but as a manufacturer and an equipment provider of full 4G stack,\" Scindia added, as quoted by PTI. PM Modi will also launch India’s 100 per cent 4G saturation network through Digital Bharat Nidhi, connecting 29,000–30,000 villages in a mission-mode project. Lifestyle Entertainment Lifestyle Lifestyle Lifestyle Lifestyle Lifestyle Entertainment tv Entertainment", "summary": "Infrastructure News: Prime Minister Narendra Modi is set to launch BSNL's indigenous 4G network on September 27, positioning India among the select nations manufacturing t", "author": "TOI Business Desk", "date_published": "Updated: Sep 26, 2025, 19:41 IST", "keywords": "India Swadeshi 4G network,BSNL 4G towers,PM Modi commissioning,BSNL,C-DOT", "image_url": "https://static.toiimg.com/thumb/msid-124159248,imgsize-1144317,width-400,resizemode-4/article-42.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:37.236270", "word_count": 445, "read_time": 2, "date_machine": "Updated: Sep 26, 2025, 19:41 IST", "tags": ["India Swadeshi 4G network", "BSNL 4G towers", "PM Modi commissioning", "BSNL", "C-DOT"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/indias-swadeshi-4g-push-pm-modi-launches-bsnls-indigenous-services-heres-all-you-need-to-know/articleshow/124179908.cms", "headline": "India's 'swadeshi' 4G push: PM Modi launches BSNL's indigenous services - Here's all you need to know", "content": "Trending / TIMESOFINDIA.COM / Prime Minister Modi inaugurated projects worth over Rs 60,000 crore in Odisha. BSNL's indigenous 4G network launched, a major telecom milestone. Over 97,500 4G towers were commissioned across multiple states. Two semiconductor units received approval for Odisha. Railway, healthcare, and education sectors also saw new initiatives. The government highlighted its vision for self-reliance. NEW DELHI: Prime Minister Narendra Modi on Saturday inaugurated development projects worth over Rs 60,000 crore in Odisha, spanning telecom, railways, healthcare, higher education, and skill development. In a landmark for India's telecom sector, PM Modi launched ’s indigenous 4G ‘Swadeshi network stack’, placing the country among a select group—including Denmark, Sweden, South Korea, and China, that have developed homegrown telecom technology. PM Modi underlined that Odisha is \"advancing at the speed of a double engine,\" with development accelerating both for the state and for India’s growth. \"Today, we are seeing that Odisha has started advancing at the speed of a double engine. Today, once again, for the development of Odisha, for the development of the country, work on projects worth thousands of crores of rupees has begun. From today, a new avatar of BSNL has also emerged. BSNL's indigenous 4G services have been launched,\" PM Modi said. Commissioning more than 97,500 4G mobile towers built at a cost of Rs 37,000 crore, PM Modi marked the launch of BSNL's indigenous 4G services, including 92,600 new BSNL sites. Over 18,900 towers funded under the Digital Bharat Nidhi will connect 26,700 unserved villages, many in remote and border areas. The solar-powered towers form India’s largest cluster of green telecom sites, ANI reported. Prime Minister Narendra Modi inaugurated the country’s fully indigenous 4G stack and over 97,500 BSNL towers from Jharsuguda. These towers are spread across Odisha, Andhra Pradesh, Uttar Pradesh, Maharashtra, Rajasthan, Assam, Gujarat, and Bihar. Also read- The Prime Minister also announced that the Centre has approved two semiconductor units for Odisha, further boosting local industry. He was joined by Odisha CM Mohan Charan Majhi and Governor Hari Babu Kambhampati at the event. In railways, PM Modi laid foundation stones for projects like the Sambalpur-Sarla rail flyover and doubling of the Koraput-Baiguda and Manabar-Koraput-Gorapur lines, alongside flagging off the Amrit Bharat Express between Berhampur and Udhna (Surat) to improve affordable connectivity and boost tourism. Healthcare projects include upgrading MKCG Medical College (Berhampur) and VIMSAR (Sambalpur) into super-specialty hospitals with expanded trauma care, maternal and child health facilities, and new dental colleges. He further announced the expansion of eight IITs, creating capacity for 10,000 new students in the next four years, along with skill development initiatives tailored to Odisha’s youth. Reiterating his government’s vision of self-reliance, PM Modi highlighted a recent Rs 70,000 crore shipbuilding package, calling it critical for national security and economic strength. \"It is our resolve that from chip to ship, India must be self-reliant in everything. Any country that wants to be economically strong gives great importance to shipbuilding. Whether it is trade, technology, or national security, shipbuilding provides benefits in every field. Any country that wants to be economically strong gives a lot of emphasis on large-scale shipbuilding. Whether it's trade, technology, or the country's security, shipbuilding benefits everywhere. If we have our own ships, there will be no hindrance in imports and exports with the world during times of crisis,\" he noted. Lifestyle Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment Lifestyle", "summary": "Infrastructure News: Prime Minister Modi inaugurated projects worth over Rs 60,000 crore in Odisha. BSNL's indigenous 4G network launched, a major telecom milestone. Over", "author": "TOI Business Desk", "date_published": "Updated: Sep 27, 2025, 18:10 IST", "keywords": "Odisha development projects,BSNL indigenous 4G launch,PM Modi Odisha projects,Odisha semiconductor units,shipbuilding package India,BSNL", "image_url": "https://static.toiimg.com/photo/63379366.cms", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:38.085001", "word_count": 564, "read_time": 3, "date_machine": "Updated: Sep 27, 2025, 18:10 IST", "tags": ["Odisha development projects", "BSNL indigenous 4G launch", "PM Modi Odisha projects", "Odisha semiconductor units", "shipbuilding package India", "BSNL"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/indias-first-bullet-train-on-tracks-soon-surat-bilimora-section-ready-by-2027-check-details/articleshow/124181407.cms", "headline": "India’s first bullet train on tracks soon! Surat-Bilimora section ready by 2027; check details", "content": "Trending / TIMESOFINDIA.COM / Union Railway Minister Ashwini Vaishnaw announced India's first bullet train, the Surat to Bilimora stretch, will be operational by 2027, highlighting significant progress on tracks and stations. New technologies are being implemented, and the Surat station features passenger comfort, connectivity, and sustainability. The Mumbai-Ahmedabad corridor is also advancing steadily with substantial infrastructure work completed. Union railway minister Ashwini Vaishnaw announced on Saturday that India’s first bullet train will soon be a reality, with the Surat to Bilimora stretch set to become operational by 2027. He said work on the stations and tracks is making “really good progress” and that several new technologies on the tracks could benefit future railway projects across India. Speaking to ANI during an inspection, Vaishnaw said, “The first section of that will become operational is Surat to Bilimora. I inspected the work of the station and track laying; this is really good progress. Several new technologies have been introduced into the work on tracks. These new technologies are unique for bullet train project. We will benefit from this in several other project in the country. If you look at the station, there is a speciality there, too. All trains will halt at Surat Station, there are two tracks at the side and two in the centre, there are two platforms here - one in Mumbai's direction and another in Ahmedabad's direction. ” He also highlighted the design of high-speed rail turnouts, saying, “High-speed rail turnouts are very specially designed because when trains run at speeds of 320, 330, 340 km/hr and when two tracks are connecting, there should be no gap. So, I saw several new things...The first section of Surat to Bilimora will become operational in 2027.” The upcoming Surat station has been designed with passenger comfort in mind. Interiors are bright and airy, with natural light from skylights, well-ventilated platforms, and modern amenities including waiting lounges, nurseries, restrooms, and retail outlets. Multiple lifts and escalators will make movement across levels easy, with facilities designed for the elderly, differently-abled, and families with children. Clear signages, information kiosks, and public announcements will guide passengers throughout the station. Connectivity is a major focus. The station will link smoothly with buses, taxis, metro trains, and other local transport through a Multi-Modal Integration plan developed with the Surat Municipal Corporation and Surat Urban Development Authority. This will ensure faster, safer, and more convenient travel for passengers. Located in Antroli village near Surat-Bardoli Road, the station is well-connected to transport hubs: the BRTS bus stop is 330 metres away, the proposed metro station 280 metres, Surat Railway Station 11 km, and NH-48 just 5 km away. Sustainability has also been prioritised. Features like rainwater harvesting, low-flow sanitary fittings, eco-friendly paints, and landscaping will reduce environmental impact while creating a pleasant atmosphere. Reflecting Surat’s renowned diamond industry, the station’s facade and interiors are inspired by diamond facets. Structural work is complete, with interiors, roofing, and station facilities in progress. The building will be 26.3 metres tall and cover 58,352 sq metres. The 508 km Mumbai-Ahmedabad Bullet Train corridor is progressing steadily. So far, 323 km of viaduct and 399 km of pier work is done. Seventeen river bridges, five pre-stressed concrete bridges, and nine steel bridges have been completed. More than 400,000 noise barriers have been installed along 210 km, and 210 track km of track bed has been finished. Work on tunnels in Maharashtra is underway, with 5 km of a 21 km tunnel already excavated. Rolling stock depots at Surat and Ahmedabad are under construction, and superstructure work on all Gujarat stations is at an advanced stage. Lifestyle Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment Lifestyle", "summary": "Infrastructure News: Union Railway Minister Ashwini Vaishnaw announced India's first bullet train, the Surat to Bilimora stretch, will be operational by 2027, highlighting", "author": "TOI Business Desk", "date_published": "Sep 27, 2025, 17:51 IST", "keywords": "India's first bullet train,Surat to Bilimora stretch,bullet train project,high-speed rail turnouts,Mumbai-Ahmedabad Bullet Train corridor", "image_url": "https://static.toiimg.com/thumb/msid-124182132,imgsize-264210,width-400,resizemode-4/this-is-an-ai-generated-image-used-only-for-representative-purpose.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:41.001946", "word_count": 612, "read_time": 3, "date_machine": "Sep 27, 2025, 17:51 IST", "tags": ["India's first bullet train", "Surat to Bilimora stretch", "bullet train project", "high-speed rail turnouts", "Mumbai-Ahmedabad Bullet Train corridor"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/indian-railways-revises-contract-conditions-introduces-localisation-price-variation-clauses-compliance-with-gst-norms-in-focus/articleshow/124150486.cms", "headline": "Indian Railways revises contract conditions: Introduces localisation, price variation clauses; compliance with GST norms in focus", "content": "/ TIMESOFINDIA.COM / Indian Railways has updated its tender contract conditions to prioritize localization, price variation, and maintenance, aiming for greater procurement flexibility and reduced litigation. The revised framework extends the defect replacement timeframe for contractors and grants zones more procurement autonomy. These changes, coupled with GST compliance measures, support India's infrastructure expansion plans, including significant additions to wagons, locomotives, and track works. has revised its standard conditions of contract for tenders, introducing localisation and price variation clauses while emphasizing maintenance during contract execution, officials said. The changes aim to make procurement more flexible and reduce litigation. \"Contractors can replace faulty or rejected goods within 60 days of being informed of defects. They had just 21 days to do so in the earlier contract conditions,\" a senior official said, as quoted by ET. The revised framework also provides zones and production units with greater flexibility in procurement. \"Conditions related to joint ventures and consortiums, import and global tenders, and goods and services tax (GST) during tender evaluation are excluded from these standard conditions,\" a senior official added. The official also noted that the dispute resolution clause has been removed from standard conditions of contract and will now be issued under revised tender guidelines. In addition to maintenance, the updated contracts strengthen GST compliance. Trucks and air-conditioners have been identified as critical items where the recent GST rate rationalisation must be diligently applied. Works contracts provided by sub-contractors and services of goods transport agencies will also benefit from the lowered rates effective Monday. The Railway Board has instructed that checks be carried out when processing supplier bills to avoid payment errors, reported ET. The railways slightly exceeded its 2024-25 capital expenditure estimate of Rs 2.65 lakh crore, with roughly 28% of the budget spent in the first quarter. These updates are expected to support India’s ongoing infrastructure expansion, as the railways continues to add 30,000 wagons, 1,500 locomotives annually, and around 5,300 km of track works. Entertainment tv Entertainment Lifestyle tv Entertainment Entertainment Entertainment Lifestyle Lifestyle", "summary": "Infrastructure News: Indian Railways has updated its tender contract conditions to prioritize localization, price variation, and maintenance, aiming for greater procuremen", "author": "TOI Business Desk", "date_published": "Sep 26, 2025, 12:47 IST", "keywords": "Indian Railways,contract conditions,localisation clause,GST compliance,maintenance,price variation clause,tenders,procurement flexibility", "image_url": "https://static.toiimg.com/thumb/msid-124150662,imgsize-838610,width-400,resizemode-4/1-22.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:41.670626", "word_count": 335, "read_time": 2, "date_machine": "Sep 26, 2025, 12:47 IST", "tags": ["Indian Railways", "contract conditions", "localisation clause", "GST compliance", "maintenance", "price variation clause", "tenders", "procurement flexibility"]},
{"url": "https://timesofindia.indiatimes.com/business/infrastructure/india-bets-on-green-infra-rs-500-crore-allocated-to-develop-hydrogen-highways-moment-to-lead-in-clean-fuels-says-gadkari/articleshow/124155524.cms", "headline": "India bets on green infra: Rs 500 crore allocated to develop hydrogen highways; ‘moment to lead in clean fuels,' says Gadkari", "content": "Trending / TIMESOFINDIA.COM / Nitin Gadkari announced India's first hydrogen highways, allocating ₹500 crore for truck trials across key freight routes. The initiative aims to produce 5 million tonnes of green hydrogen annually by 2030, creating jobs and attracting investments. This move will reduce crude oil dependence and lower carbon emissions, positioning India as a leader in clean fuels. NEW DELHI: Road Transport and Highways Minister on Thursday announced the launch of India’s first hydrogen highways, marking a major step toward clean, long-haul transport and reduced crude oil dependence. Speaking virtually at the World Hydrogen India event hosted by S&P Global Commodity Insights, Gadkari said hydrogen would be “the fuel of the future” as the government begins large-scale truck trials across 10 key freight routes linking industrial hubs, ports and major cities including Delhi, Mumbai, Pune, Ahmedabad, Kochi, Vishakhapatnam and Thiruvananthapuram. He said a budgetary allocation of Rs 500 crore had been made for five industry consortiums to operate 37 heavy vehicles and set up nine refuelling stations with partners such as , , Volvo, BPCL, IOCL, NTPC and Reliance. \"Hydrogen is the fuel of the future. We have now launched the world's first large-scale hydrogen truck trials. A budgetary allocation of Rs 500 crore has been sanctioned to five consortiums across ten routes, with 37 vehicles participating. Industry partners include Tata Motors, Ashok Leyland, Volvo, BPCL, IOCL, NTPC and Reliance. Nine hydrogen refuelling stations will be established to support these trials. These corridors will serve as India's first hydrogen highways, creating the ecosystem for clean, long-haul mobility,\" said the transport minister, as quoted by ANI. Gadkari outlined plans to produce 5 million tonnes of green hydrogen annually by 2030, a move aimed at creating around 6 lakh jobs and attracting Rs 8 lakh crore in investments. This transition, he said, would cut India’s crude import bill—now 87 per cent of demand at a cost of Rs 22 lakh crore a year—by Rs 1 lakh crore annually and lower carbon emissions by 3.6 gigatons by 2050, “comparable to planting more than 1,000 crore trees. ” \"India will be a manufacturer, an innovator, and an exporter. We will convert agriculture into energy, secure our fuel supplies, create jobs, and cut emissions all at once. This is India's moment to lead in clean fuels,” he said. Former NITI Aayog CEO Amitabh Kant stressed that green hydrogen is central to India’s ambition of becoming a USD 30 trillion economy by 2047, calling it “not just an energy story, but one about jobs, exports, manufacturing, competitiveness and climate leadership.” He said only green hydrogen can decarbonise hard-to-abate sectors such as cement, shipping, aviation and long-haul transport. Highlighting India’s advantages of low-cost renewables, a clear policy framework, a strong industrial base and export prospects to Japan and Europe, Kant urged action on domestic electrolyser manufacturing, intergovernmental agreements, skill development and robust regulations to make India “the global hydrogen centre.” Lifestyle Lifestyle Lifestyle Entertainment tv Entertainment tv Lifestyle Entertainment Entertainment", "summary": "Infrastructure News: Nitin Gadkari announced India's first hydrogen highways, allocating ₹500 crore for truck trials across key freight routes. The initiative aims to prod", "author": "TOI Business Desk", "date_published": "Updated: Sep 26, 2025, 17:32 IST", "keywords": "hydrogen highways,Nitin Gadkari,clean transport,NITI Aayog,India's energy transition,green hydrogen,Tata Motors,Ashok Leyland", "image_url": "https://static.toiimg.com/thumb/msid-124157777,imgsize-1052978,width-400,resizemode-4/article-39.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:42.833829", "word_count": 494, "read_time": 2, "date_machine": "Updated: Sep 26, 2025, 17:32 IST", "tags": ["hydrogen highways", "Nitin Gadkari", "clean transport", "NITI Aayog", "India's energy transition", "green hydrogen", "Tata Motors", "Ashok Leyland"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/new-gst-rates-in-india-september-22-navratri-full-list-of-items-with-updated-gst-rates-what-is-cheaper-and-dearer-after-gst-rate-cuts-in-0-5-18-40-slabs/articleshow/124031082.cms", "headline": "New GST rates take effect: Full list of items with updated GST rates; what is cheaper & dearer after GST rate changes? Check now!", "content": "Trending / TIMESOFINDIA.COM / New GST rates 2025 full list effective today: The Modi government's next-generation GST reforms take effect on September 22, 2025, coinciding with the start of Navratri. These reforms reduce tax slabs to 5% and 18%, making household items, cars, and food cheaper. Here is the full list of new item-wise GST rates: In a big cheer at the start of the festive season, the next generation reforms announced by the Modi government come into effect today, on September 22, 2025. From today, a plethora of household items, cars, TVs, bikes will become cheaper for the common man and middle class. Many food items have been moved to the NIL or 0% tax bracket. These include roti, parantha, paneer, khakra etc. Importantly, health and life insurance premiums will be exempt from GST. The new GST rates, first announced by FM Nirmala Sitharaman earlier this month, reduce the tax slabs to two broad rates - 5% and 18%. While most items under GST have seen rate cuts, some limited items will now also be dearer with higher tax rates - such as clothes priced above Rs 2,500 will now attract a higher GST rate of 18% compared to 12% before. Ahead of the GST rate cuts becoming effective, PM Narendra Modi addressed the nation saying, “With sunrise on September 22nd, the first day of Navratri, the Next Generation GST reforms will come into effect. In a way, a GST savings festival is going to begin in the country from tomorrow. This GST Savings Festival will increase your savings, and you'll be able to purchase the things you want more easily. The poor, middle class people, neo middle class, youth, farmers, women, shopkeepers, businessmen, entrepreneurs of our country, everyone will benefit a lot from this savings festival. ” “Due to reduction in GST, it will now be easier for the citizens of the country to fulfill their dreams. Be it building a house, buying a TV, a refrigerator, or buying a scooter, bike, or a car, you'll have to spend less on all of these. Travelling will also become cheaper for you, as GST has been reduced on rooms in most hotels,” he added. Lifestyle Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment Lifestyle", "summary": "India Business News: New GST rates 2025 full list effective today: The Modi government's next-generation GST reforms take effect on September 22, 2025, coinciding with the", "author": "TOI Business Desk", "date_published": "Updated: Sep 27, 2025, 16:01 IST", "keywords": "gst,goods and services tax,gst rate cuts,new gst rates 2025,new gst rates full list,new gst slabs,dhanteras,diwali", "image_url": "https://static.toiimg.com/thumb/msid-124031450,imgsize-61380,width-400,resizemode-4/new-gst-rates-2025-full-list.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:44.012288", "word_count": 375, "read_time": 2, "date_machine": "Updated: Sep 27, 2025, 16:01 IST", "tags": ["gst", "goods and services tax", "gst rate cuts", "new gst rates 2025", "new gst rates full list", "new gst slabs", "dhanteras", "diwali"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/curb-russia-oil-imports-us-tells-india-crude-buy-key-factor-in-reducing-tariffs-sealing-trade-deal/articleshow/124164517.cms", "headline": "‘Curb Russia oil imports’: US tells India - Crude buy key factor in reducing tariffs, sealing trade deal", "content": "Trending / TIMESOFINDIA.COM / US trade negotiators reportedly linked a trade deal and tariff reduction to India curbing Russian oil imports, following increased US tariffs on Indian goods. India, maintaining its stance on Russian purchases, proposed importing Iranian and Venezuelan oil as an alternative. India-US trade deal is contingent on India curbing its Russian crude oil imports, US trade negotiators have reportedly told Indian officials. Trade officials from the United States have informed India's negotiators that a curb in Russian oil imports is essential for lowering India's tariff rates and finalising a trade agreement, sources told Reuters. Last month, President Donald Trump increased tariffs on Indian products to 50% of which 25% tariffs are of India’s crude oil imports from Russia. India responded firmly, maintaining its position on Russian purchases and describing US actions as \"unfair, unjustified and unreasonable.\" US Urges India to Stop Buying Russian Oil, Offers Energy Cooperation Instead A US official told the news agency that whilst trade talks with India were progressing well, further discussions were necessary to resolve American concerns about market access, trade imbalances and India's ongoing procurement of Russian oil. According to a Bloomberg report, US trade representatives emphasised to their Indian colleagues that addressing the Russian oil issue was essential for reducing India's tariff rates and finalising a trade agreement. Despite positive dialogue this week, no major progress was achieved, according to the report. Who bought Russia's fossil fuels after EU bans Commerce Minister , leading the Indian delegation, proposed increased purchases of American defence and energy products as concessions, the report said. On Wednesday, Goyal expressed India's willingness to increase energy imports from the US \"in the years to come.\" Also Read | The trade discussions in the US from September 22-24 were productive, with both parties discussing potential agreement parameters, . Goyal conducted meetings with US Trade Representative Jamieson Greer and Sergio Gor, Trump's India ambassador nominee. The minister also engaged with Indian business leaders and investors during his visit. In a separate report, Bloomberg said that India has asked US to allow it to import oil from Iran and Venezuela. Russia started offering discounted oil prices following international sanctions related to the Ukraine conflict. India, which imports about 90% of its oil needs, has benefited from reduced import costs through Russian supplies. Iranian and Venezuelan oil could offer comparable price benefits. The report indicated that Indian refiners would need US nod to import crude from sanctioned nations like Iran and Venezuela if they were to significantly reduce Russian oil purchases. The visiting delegation conveyed their message during talks with Trump officials, the report said. Also Read | Those familiar with the negotiations revealed that Indian officials highlighted how simultaneously limiting their refiners' access to Russian, Iranian and Venezuelan oil could lead to a global price increase. Meanwhile, Petroleum Minister Hardeep Singh Puri on Friday said that Russian crude oil purchases face no sanctions, whilst cautioning about severe global implications if these supplies face disruption. He referenced Iran and Venezuela as examples, noting that India has consistently adhered to international sanctions as a responsible global community member. Puri highlighted Russia's position as the global second-largest crude supplier, delivering approximately 10 million barrels daily, whilst emphasising potential worldwide ramifications of supply interruptions. \"Energy is something you cannot do without ... If you remove the second-largest producer, you will have to cut consumption. The consequences are pretty serious,\" Puri said. Also Read | Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment Lifestyle Entertainment", "summary": "India Business News: US trade negotiators reportedly linked a trade deal and tariff reduction to India curbing Russian oil imports, following increased US tariffs on India", "author": "TOI Business Desk", "date_published": "Updated: Sep 26, 2025, 23:07 IST", "keywords": "Indian crude oil imports,Russia crude oil exports,donald trump tariffs,india us trade deal,india russia crude oil,Piyush Goyal", "image_url": "https://static.toiimg.com/thumb/msid-124164906,imgsize-61574,width-400,resizemode-4/india-russia-us-crude-dynamics.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:45.408851", "word_count": 581, "read_time": 3, "date_machine": "Updated: Sep 26, 2025, 23:07 IST", "tags": ["Indian crude oil imports", "Russia crude oil exports", "donald trump tariffs", "india us trade deal", "india russia crude oil", "Piyush Goyal"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/deposit-claims-up-to-rs-15l-get-easier-for-kin-of-deceased/articleshow/124169468.cms", "headline": "Deposit claims up to Rs 15L get easier for kin of deceased", "content": "Trending TNN / The RBI has introduced new rules simplifying claims for deceased bank customers, allowing nominees to claim up to Rs 15 lakh from banks and Rs 5 lakh from co-operative banks. These standardized procedures cover deposits, lockers, and safe custody items. Banks must settle claims within 15 days, with penalties for delays. MUMBAI: has issued new rules on Friday that in the event of a bank customer's death, deposits of up to Rs 15 lakh can be claimed by their nominees through a simplified process. For co-operative banks, the limit has been set at Rs 5 lakh. RBI's new norms have standardised procedures across banks for deposits, safe deposit lockers, and articles in safe custody. The framework replaces earlier circulars and introduces uniform documentation, thresholds, and timelines. The new rules have to be implemented by the end of the current fiscal. For deposits without a nominee, survivorship clause, or will - and where there is no court order or contesting claim - banks must settle claims on submission of a claim form, death certificate, valid ID of the claimant, an indemnity bond, and, if applicable, a letter of disclaimer from other heirs. A legal heir certificate or a declaration by an independent person acceptable to the bank is also required. Banks cannot demand a third-party surety bond for claims within the threshold. RBI has fixed a 15-day deadline for banks to settle deposit claims after receiving all documents. For lockers and safe custody articles, banks must contact claimants and set an inventory date within 15 days. Delays will attract penalties - interest at bank rate plus 4% per annum for deposits, and Rs 5,000 per day for lockers and safe custody items. Banks have been directed to implement the new rules at the earliest, and no later than March 31, 2026. Entertainment Lifestyle Entertainment Lifestyle Lifestyle Lifestyle Lifestyle Lifestyle Entertainment tv", "summary": "India Business News: The RBI has introduced new rules simplifying claims for deceased bank customers, allowing nominees to claim up to Rs 15 lakh from banks and Rs 5 lakh", "author": "TNN /", "date_published": "Sep 27, 2025, 01:30 IST", "keywords": "RBI,deposits,claims,bank customer", "image_url": "https://static.toiimg.com/thumb/msid-124169489,imgsize-50126,width-400,resizemode-4/-.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:46.834329", "word_count": 313, "read_time": 2, "date_machine": "Sep 27, 2025, 01:30 IST", "tags": ["RBI", "deposits", "claims", "bank customer"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/not-a-med-emergency-generic-pharma-cos-spared-from-harm/articleshow/124169497.cms", "headline": "Not a med emergency: Generic pharma cos spared from harm", "content": "& / TNN / Trump's new 100% pharma levy primarily targets branded and patented medicines, potentially impacting Sun Pharma and Biocon's US sales. While most Indian generic firms anticipate business as usual, some may shift high-value production to US facilities or diversify markets. NEW DELHI/HYDERABAD: India's generic companies are likely to continue in business-as-usual mode as US President Donald Trump's 100% levy on pharmaceuticals is targeted at branded and patented medicines, but it may also prompt some of them to rethink their playbook. Industry experts told TOI that the country's largest drugmaker Sun Pharma could face headwinds as its drug sales in US totalled $1.1 billion in FY25 (in which patented drugs have a significant portion), which was around 17% of its total revenue. Analysts added that branded biosimilars manufactured by companies, including Biocon, may be affected. Companies with manufacturing bases in US - including Sun Pharma, Dr Reddy's and Cipla - could cushion the blow by shifting production of higher-value specialty and niche drugs from India to the American facilities, said experts. Over time, the move could drive companies to diversify export markets, recalibrate global strategies, shift to contract manufacturing in the US and set up manufacturing bases there to safeguard access to the world's most lucrative market. \"At this point, we do not see an impact,\" Dr Reddy's co-chairman & MD G V Prasad said, adding, the company also does not see expanding its manufacturing footprint in the US immediately. \"Domestic companies are examining all options to mitigate risk, ranging from setting up manufacturing facilities in the US to shifting production of high-value specialty drugs, niche therapies and peptides to existing plants,\" an industry expert said. India's pharma exports to the US were close to $10 billion last year and it serviced around 35% of US prescriptions with affordable generics. \"India plays a vital role in US healthcare by ensuring a steady supply of affordable medicines. A majority of life-saving cardiac, diabetes and chronic medicines are supplied from India,\" said Indian Pharmaceutical Alliance secretary general Sudarshan Jain. Deepak Jotwani, VP & sector head, corporate ratings, Icra added, \"Overall, this move by the US underscores the need for Indian pharma companies to diversify markets and innovate in complex generics and biosimilars to stay resilient in a changing global trade landscape. \" Pharmexcil chairman Namit Joshi said most large Indian companies already operate manufacturing or repackaging units in US and are exploring further acquisitions. \"India will need to reinforce its cost-efficiency advantage in bulk drugs and APIs, an area where the US is likely to favour India over other suppliers, and simultaneously invest in next-generation opportunities, such as complex generics, peptides and biosimilars. \" The pharma sector is awaiting more clarity on the announcement as it did not specify whether speciality drugs, niche or complex generic drugs are under its ambit. However, a few experts said there was uncertainty over the definition of \"branded\" drugs. \"If we take the terms branded and patented products at face value, Granules does not fall into either category,\" Granules India ED Priyanka Chigurupati said. Entertainment Lifestyle Entertainment Lifestyle Lifestyle Lifestyle Lifestyle Lifestyle Entertainment tv", "summary": "India Business News: Trump's new 100% pharma levy primarily targets branded and patented medicines, potentially impacting Sun Pharma and Biocon's US sales. While most Indi", "author": "Swati Bharadwaj", "date_published": "Sep 27, 2025, 01:33 IST", "keywords": "generic pharmaceutical companies,US pharmaceutical levy,Indian pharma exports,manufacturing bases in the US,biosimilars", "image_url": "https://static.toiimg.com/thumb/msid-124169520,imgsize-24278,width-400,resizemode-4/-.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:48.260866", "word_count": 520, "read_time": 3, "date_machine": "Sep 27, 2025, 01:33 IST", "tags": ["generic pharmaceutical companies", "US pharmaceutical levy", "Indian pharma exports", "manufacturing bases in the US", "biosimilars"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/risks-appear-manageable-for-now-finmin/articleshow/124169549.cms", "headline": "Risks appear manageable for now: Finmin", "content": "Trending TNN / India's finance ministry cautions that persistent tariff uncertainties could impact export sectors, employment, and consumption, though government reforms are expected to cushion the economy. While risks appear manageable now, challenges like slower market maturation and threats to services, exemplified by US H-1B fees, remain. Sustaining growth requires regulatory reform, infrastructure development, and state-level deregulation. NEW DELHI: There will be an impact on export sectors with spillover risk to domestic employment, income and consumption if tariff uncertainties persist, a finance ministry report said, adding, govt's reform agenda is expected to cushion economy against adverse effects of trade disruptions. \"Newer markets will take time to mature and contribute to export growth as established markets have. The decision by the US govt to impose a fee on new H-1B visa-seekers is a reminder of the risks of trade uncertainties affecting the hitherto unaffected services sector,\" said the finance ministry's monthly report for Aug. \"For now, risks appear manageable, but they are there,\" said the report. It said regulatory reform and infrastructure development will be key to sustaining growth momentum. \"States will do well to leverage cooperative federalism and contribute to this effort by pursuing state-level deregulation, thereby putting India's economy on a higher growth trajectory,\" said the report. It said the near-term outlook is characterised by steady, reform-driven growth rooted in macro discipline and adaptive economic diplomacy, with vigilance warranted against external shocks and global market volatility. The report said that taking advantage of the strong monsoon and even excess rains, India must invest in water storage, deepening, desilting, and rejuvenating water bodies. Entertainment Lifestyle Entertainment Lifestyle Lifestyle Lifestyle Lifestyle Lifestyle Entertainment tv", "summary": "India Business News: India's finance ministry cautions that persistent tariff uncertainties could impact export sectors, employment, and consumption, though government ref", "author": "TNN /", "date_published": "Sep 27, 2025, 01:38 IST", "keywords": "Finance Ministry report,trade uncertainties,export sectors,domestic employment,tariff uncertainties", "image_url": "https://static.toiimg.com/thumb/msid-47529300,imgsize-110164,width-400,resizemode-4/47529300.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:49.735302", "word_count": 273, "read_time": 1, "date_machine": "Sep 27, 2025, 01:38 IST", "tags": ["Finance Ministry report", "trade uncertainties", "export sectors", "domestic employment", "tariff uncertainties"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/tata-capitals-stock-market-debut-ipo-launch-set-for-october-6-what-we-know/articleshow/124168141.cms", "headline": "Tata Capital's stock market debut: IPO launch set for October 6; what we know", "content": "Trending / TIMESOFINDIA.COM / Tata Capital is set to launch its IPO on October 6, offering 47.58 crore shares, comprising fresh shares and an offer for sale from Tata Sons and IFC. The anticipated IPO size is Rs 17,200 crore. This development follows a significant 35% decline in its unlisted share prices, dropping from Rs 1,125 to Rs 735. Tata Capital is set to launch its initial public offering ( ) on October 6, featuring fresh shares and an offer for sale, as reported by Reuters. The anchor bidding opens on October 3, with the issue closing on October 8. According to the updated draft red herring prospectus (UDRHP), the offering includes up to 21 crore new shares and 26.58 crore shares from existing shareholders, totalling 47.58 crore shares for public bidding. The offer for sale includes 23 crore shares from promoter Tata Sons Private Limited and over 3.58 crore shares from International Finance Corporation (IFC). The acquisition cost per equity share stands at Rs 34 for Tata Capital and Rs 25 for IFC, as per the UDRHP. The IPO's book running lead managers include Kotak Mahindra Capital Company Limited, Axis Capital Limited, BNP Paribas, Limited, HSBC Securities and Capital Markets (India) Private Limited, ICICI Securities Limited, IIFL Capital Services Limited, J.P. Morgan India Private and SBI Capital Markets Limited. MUFG Intime India Private Limited serves as the registrar. Currently, Unlisted Zone reports Tata Capital's unlisted shares trading at Rs 735 per share, whilst Wealth Wisdom indicates a lower value of Rs 650 per share, as reported by ET. The anticipated IPO size is Rs 17,200 crore. The unlisted shares have experienced pressure due to financial sector weakness, price discovery challenges, and valuation concerns. Share prices have decreased by approximately 35% from Rs 1,125 in April to Rs 735, according to UnlistedZone data, cited by ET. Entertainment tv Entertainment Entertainment Entertainment Lifestyle Entertainment Lifestyle Lifestyle Lifestyle", "summary": "India Business News: Tata Capital is set to launch its IPO on October 6, offering 47.58 crore shares, comprising fresh shares and an offer for sale from Tata Sons and IFC.", "author": "TOI Business Desk", "date_published": "Sep 27, 2025, 07:00 IST", "keywords": "Tata Capital IPO launch,Tata Capital shares,IPO book running lead managers,Tata Sons Private Limited shares,Tata Capital,ipo,HDFC Bank", "image_url": "https://static.toiimg.com/thumb/msid-124168346,imgsize-179710,width-400,resizemode-4/.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:51.200957", "word_count": 316, "read_time": 2, "date_machine": "Sep 27, 2025, 07:00 IST", "tags": ["Tata Capital IPO launch", "Tata Capital shares", "IPO book running lead managers", "Tata Sons Private Limited shares", "Tata Capital", "ipo", "HDFC Bank"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/proliferation-of-trade-restrictive-actions-trump-tariff-take-center-stage-at-brics-fm-meet-warned-move-to-threaten-global-supply-chains/articleshow/124178758.cms", "headline": "'Proliferation of trade-restrictive actions': Brics declaration slams Trump tariffs; warns move to threaten global supply chains", "content": "Trending / TIMESOFINDIA.COM / BRICS foreign ministers condemned Trump-era US tariffs as trade-restrictive actions disrupting global supply chains and economic stability. Meeting on the sidelines of UNGA80, the expanded group, including new members, also pushed for reforms in global institutions like the UN Security Council and greater representation for developing nations, underscoring their growing influence. NEW DELHI: Foreign ministers of Brics nations, meeting on the sidelines of the 80th UN General Assembly (UNGA80), slammed Donald Trump-led US administration's tariffs on over 70 countries, calling them a \"proliferation of trade-restrictive actions\" that endanger global supply chains and economic stability. In their joint statement, the ministers said they were concerned \"over proliferation of trade-restrictive actions, whether in the form of indiscriminate rising of tariffs and non-tariff measures, or protectionism.\" They added that in particular such \"measures are used as a means of coercion that threaten to further reduce global trade, disrupt global supply chains, and introduce uncertainty into international economic and trade activities, potentially exacerbating existing economic disparities and affecting prospects for global economic development.\" The session, chaired by external affairs minister S Jaishankar was also attended by foreign ministers from Brazil, Russia, China, South Africa, and new Brics members including Iran, Indonesia, the UAE, Ethiopia, and Egypt, underscored the group’s growing influence as a platform for the Global South. The meeting also underscored India's upcoming Brics presidency in 2026, signaling its central role in guiding the bloc's agenda. The ministers also reaffirmed their commitment to enhancing the participation and representation of Emerging Markets, Developing Countries (EMDCs), and Least Developed Countries (LDCs) from Asia, Africa, Latin America, and the Caribbean in global decision-making, pushing for a more just and equitable international governance system. Highlighting the need for reforms in global institutions, the ministers backed comprehensive changes to the United Nations, including its Security Council, to make it more democratic, representative, and capable of responding to current global challenges. They also emphasised the importance of strengthening the role of the Global South and ensuring that emerging economies, including Brics members, play a larger role in international affairs. The leaders also reaffirmed support for multilateralism, multipolarity, and the full respect of international law, including the UN Charter. The ministers stressed the importance of continuity, coordination, and institutional development within Brics to amplify the collective voice of developing nations and promote inclusive global governance, the statement added. Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment Lifestyle Entertainment", "summary": "India Business News: BRICS foreign ministers condemned Trump-era US tariffs as trade-restrictive actions disrupting global supply chains and economic stability. Meeting on", "author": "TOI Business Desk", "date_published": "Updated: Sep 27, 2025, 14:15 IST", "keywords": "BRICS nations,Foreign ministers,US tariffs,trade-restrictive actions,global supply chains,UN General Assembly", "image_url": "https://static.toiimg.com/photo/63379366.cms", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:52.059295", "word_count": 402, "read_time": 2, "date_machine": "Updated: Sep 27, 2025, 14:15 IST", "tags": ["BRICS nations", "Foreign ministers", "US tariffs", "trade-restrictive actions", "global supply chains", "UN General Assembly"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/bloodbath-on-dalal-street-indian-stocks-sink-after-trumps-twin-blows-440-of-500-stocks-tumble-on-bse-500/articleshow/124183235.cms", "headline": "Bloodbath on Dalal Street: Indian stocks sink after Trump’s twin blows; 440 of 500 stocks tumble on BSE 500", "content": "Trending / TIMESOFINDIA.COM / Dalal Street plunged this week, with over 440 BSE 500 stocks in red, following US President Trump’s H-1B visa fee hike and new medicine tariffs. The BSE 500 dropped 3.3%, led by IT and pharma sector losses. While Coforge and Tech Mahindra saw significant declines, 44 stocks, including Tata Investment Corporation, defied the gloom. Dalal Street took a hit this week as more than 440 out of 500 stocks on the BSE 500 ended in red after two heavy blows from US President Donald Trump. The BSE 500 index dropped 3.3% while 17 names fell by double digits and lost as much as 14%. All sectors closed lower on the week, led by IT shares, followed by real estate, consumer and healthcare stocks. The first hit came on September 19, when Trump signed an executive order raising the annual H-1B visa application fee from $1,000 to $100,000 per applicant. After the announcement, IT stocks were the worst affected. The second setback landed this Friday (26 September), when the US president announced tariffs of up to 100% on imports of “branded and patented” medicines, effective October 1, triggering a sell-off in pharma counters. Coforge, a tier-2 IT firm, was the week’s biggest loser, dropping 14%. Caplin Point Laboratories and Avanti Feeds followed with declines of 13% and 12%. Other heavy fallers included Mphasis, Redington, Balrampur Chini Mills, KRBL, Wockhardt, Kalyan Jewellers India and Sumitomo Chemical India, each down between 10% and 12%. Well-tracked names such as Laurus Labs, Mastek, Aarti Drugs, Praj Industries, Sterling and Wilson Renewable Energy, Nesco and Persistent Systems also lost in double digits. Despite the gloom, 44 stocks ended higher. Tata Investment Corporation jumped 18%, while Hindustan Copper gained 10.4%. NLC India, IFB Industries, Deepak Fertilisers, Minda Corporation, AU Small Finance Bank, Adani Power, CSB Bank and Asahi India Glass ranked among the top gainers, with rises ranging from 3% to 8.4%. Adani shares also stayed in focus after the Securities and Exchange Board of India (Sebi) cleared Gautam Adani and group firms of Hindenburg Research’s allegations of violations involving related-party transactions and fund diversion. The Sensex fell 2.7% during the week, weighed down by big names such as Tata Consultancy Services (TCS) and Infosys, which slid nearly 9% and 6%. Tech Mahindra led the losses at over 9%, while Trent, Asian Paints and Mahindra & Mahindra (M&M) were each down more than 5%. Out of 30 Sensex stocks, only three finished in positive territory, Maruti Suzuki India (up 2.5%), Axis Bank (up 1.6%) and Larsen & Toubro (up 1.5%). By sector, the hardest hit were BSE IT (-7.3%), BSE Realty (-6%), BSE Consumer Durables (-5%), BSE Healthcare (-5%), BSE Capital Goods (-4%), BSE Auto (-2.9%) and BSE FMCG (-3%). The BSE Midcap index shed 4.3%, while the BSE Smallcap index dropped 4.5%. Foreign Institutional Investors (FIIs) turned heavy sellers, offloading shares worth Rs 19,570 crore this week. Domestic Institutional Investors (DIIs), on the other hand, bought equities worth Rs 16,200 crore. Entertainment Lifestyle Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment Entertainment", "summary": "India Business News: Dalal Street plunged this week, with over 440 BSE 500 stocks in red, following US President Trump’s H-1B visa fee hike and new medicine tariffs. The B", "author": "TOI Business Desk", "date_published": "Sep 27, 2025, 20:59 IST", "keywords": "Dalal Street news,Indian stocks,Donald Trump impact on stock market,IT sector stocks fall,Pharma sector sell-off", "image_url": "https://static.toiimg.com/thumb/msid-124183937,imgsize-111036,width-400,resizemode-4/.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:52.907056", "word_count": 509, "read_time": 3, "date_machine": "Sep 27, 2025, 20:59 IST", "tags": ["Dalal Street news", "Indian stocks", "Donald Trump impact on stock market", "IT sector stocks fall", "Pharma sector sell-off"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/trade-tensions-india-brazil-south-africa-slam-unilateral-tariffs-discriminatory-and-inconsistent-with-wto/articleshow/124181824.cms", "headline": "Trade tensions: India, Brazil, South Africa slam unilateral tariffs; 'discriminatory' and 'inconsistent' with WTO", "content": "Trending / TIMESOFINDIA.COM / India, Brazil, and South Africa (IBSA) criticized unilateral tariffs and coercive trade measures, labeling them discriminatory and inconsistent with WTO rules. They warned such actions destabilize global markets and undermine the rules-based trading system, citing recent US tariffs. IBSA urged urgent restoration of the WTO's dispute settlement system and emphasized free agricultural trade. India, Brazil and South Africa have raised concerns over unilateral tariffs and other coercive trade measures, saying such steps risk destabilising global markets and undermining the World Trade Organisation ( ). At a meeting under the IBSA framework (India, Brazil, South Africa), the three nations described these measures as \"discriminatory\" and \"inconsistent\" with WTO rules. The meeting was attended by external affairs minister S Jaishankar, Brazilian foreign minister Mauro Vieira, and South African minister Sindisiwe Chikunga. Moment Lavrov, Jaishankar Shared Laugh Over Trump’s Ultimatum In New York | Watch The ministers had also urged for urgent reforms to the UN security council, Jaishankar said. In a statement, IBSA stressed the importance of a fair, balanced and mutually beneficial global trading system. It added, \"They (the ministers) reaffirmed their commitment to strengthen the centrality of the rules-based, transparent, non-discriminatory, fair, equitable, open, and inclusive multilateral trading system, with the World Trade Organization (WTO) at its core and its role in promoting predictability, stability, legal certainty and a level playing field for international trade.\" Last month, the US imposed 50% tariffs on India and Brazil, raising tensions further. The ministers expressed \"serious concern over the imposition of unilateral tariff and other discriminatory and protectionist measures, particularly measures used as a means of coercion, noting that such actions are inconsistent with the WTO and risk undermining the rules-based multilateral trading system as well as destabilising world markets fostering greater fragmentation and instability.” The three countries also highlighted their commitment to reforming and strengthening the multilateral trading system. The statement also noted disappointment that the WTO’s commitment to a fully functioning dispute settlement system by December 2024 has not been met. The ministers stressed the need to urgently restore an effective two-tier WTO dispute settlement system. Agricultural trade was another key focus. The ministers said it must remain free from unilateral, protectionist measures. \"Transparent, open, reliable, non-discriminatory, and uninterrupted international trade in agriculture and its inputs is one of the important avenues to address the global food security crisis,\" the statement said. \"The ministers also reaffirmed their commitment to strengthening even further agricultural cooperation among IBSA, including within multilateral organisations,\" it added. Lifestyle Entertainment Lifestyle Entertainment Lifestyle tv Entertainment tv Entertainment Entertainment", "summary": "India Business News: India, Brazil, and South Africa (IBSA) criticized unilateral tariffs and coercive trade measures, labeling them discriminatory and inconsistent with W", "author": "TOI Business Desk", "date_published": "Updated: Sep 27, 2025, 22:20 IST", "keywords": "Brazil,South Africa,WTO,tariffs", "image_url": "https://static.toiimg.com/thumb/msid-124184037,imgsize-157814,width-400,resizemode-4/world-trade-organization.jpg", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:53.796336", "word_count": 425, "read_time": 2, "date_machine": "Updated: Sep 27, 2025, 22:20 IST", "tags": ["Brazil", "South Africa", "WTO", "tariffs"]},
{"url": "https://timesofindia.indiatimes.com/business/india-business/trumps-100-tariffs-on-branded-drugs-indian-generics-spared-but-poses-risks-for-pharma-sector-explained/articleshow/124176474.cms", "headline": "Trump's 100% tariffs on branded drugs: Indian generics spared but pose risks for pharma sector – Explained", "content": "Trending / TIMESOFINDIA.COM / US President Trump announced a 100% tariff on imported branded and patented pharmaceuticals starting October 2025, aiming to boost domestic manufacturing. Indian generic drug makers are largely unaffected initially, but concerns loom over potential tariff expansion to complex generics. Sun Pharma faces significant exposure due to its US branded portfolio. US President 's announcement of a 100% tariff on imported \"branded and patented pharmaceutical products\" has rattled the global pharma industry, though Indian generic drug makers are largely expected to remain unaffected for now. Trump, in a post on Truth Social on Thursday, stated: \"Starting October 1st, 2025, we will be imposing a 100% Tariff on any branded or patented Pharmaceutical Product, unless a Company IS BUILDING their Pharmaceutical Manufacturing Plant in America. ‘IS BUILDING’ will be defined as, ‘breaking ground’ and/or ‘under construction.’ There will, therefore, be no Tariff on these Pharmaceutical Products if construction has started. \" The announcement sent shockwaves across Indian pharma stocks, raising concerns that the scope of the tariffs could later be extended to complex generics, biosimilars, and other advanced formulations, top officials told ET. Industry officials noted that this comes amid an ongoing US government probe under Section 232 of the US Trade Expansion Act, which is evaluating whether pharma imports pose a national security risk. A final decision is expected early next year. The move is seen as a part of a broader push to onshore pharmaceutical manufacturing in the US, reduce foreign dependency, and create domestic jobs. India exports a large volume of low-cost generic medicines that do not fall under the branded or patented category. This explains why analysts believe the tariff move may not disrupt shipments right away. Currently, Indian pharmaceutical exporters are mostly unaffected as the country primarily supplies unbranded generic drugs and formulations to the US, Suresh Subramanian, national life sciences leader at EY Parthenon told ET. However, he warned that if the tariff regime is broadened to include biosimilars and complex generics, major Indian firms such as Sun Pharma, Cipla, Lupin, and Dr Reddy’s could face financial strain. \"Unless we see the actual order, it is too early to rule out anything,\" Subramanian added. A select group of major Indian pharmaceutical manufacturers dominates exports to the US market, contributing approximately 70% of all shipments. Among Indian majors, could feel the heat if branded and specialty drugs are included in the tariff regime. The company has steadily expanded its US portfolio of specialty and branded medicines. Its global specialty sales touched $1.2 billion in FY25, accounting for nearly 20% of annual revenue. \"The 100% tariff on imports of branded medicine announced by the US may have an impact on the financials of Sun Pharmaceuticals,\" Vishal Manchanda, pharma analyst at Systematix Group told ET. \"Out of the company's total annual revenue of about $6 billion, nearly 15% comes from its branded medicine sales in the US,\" Manchanda said. He, however, added that, \"Since there is no fine print on the tariff announcement, it may be premature to comment on the impact. The tariff impact would also primarily depend on what value and from which countries Sun procures these branded medicines from.\" This comes as Sun Pharma has a strong presence in the US, with its headquarters in New Jersey and a manufacturing plant in Massachusetts, could help soften the impact. On the other hand, Dr Reddy's shows significant risk exposure, with 47% of its earnings coming from the US market, the highest amongst its competitors, according to the ET report. Nomura projects the company's US earnings to reach $1.5 billion in FY26, making it particularly susceptible to any tariff modifications. Various pharmaceutical companies show different levels of vulnerability. Lupin anticipates US revenues of $1.1 billion in FY26, with their US manufacturing facilities contributing $70-80 million, representing 6-7% of total earnings, as stated by the organisation. India, Belgium, Italy, and China also export drugs to the US but largely in the generic space. The bigger impact is likely to fall on multinational companies from Ireland, Switzerland, Germany, and Singapore, which dominate the US market for patented medicines. US import statistics from 2024 indicate total pharmaceutical imports valued at $212.82 billion, with India contributing $12.73 billion, equivalent to 5.98%. In comparison, Ireland led with $50.35 billion (23.66%), followed by Switzerland at $19.03 billion (8.94%), and Germany at $17.24 billion (8.10%). These European nations, specialising in high-value branded and patented medications, are likely to experience the strongest initial effects of the new tariff policy, according to a GTRI analysis. tv Entertainment tv Entertainment Entertainment Entertainment Lifestyle Entertainment Lifestyle Lifestyle", "summary": "India Business News: US President Trump announced a 100% tariff on imported branded and patented pharmaceuticals starting October 2025, aiming to boost domestic manufactur", "author": "TOI Business Desk", "date_published": "Updated: Sep 27, 2025, 12:11 IST", "keywords": "Donald Trump,pharmaceutical products,tariff announcement,Indian generic drug makers,US pharmaceutical market,Sun Pharmaceuticals,Zydus Lifesciences Limited,Dr. Reddy's Laboratories Limited", "image_url": "https://static.toiimg.com/photo/63379366.cms", "category": "business", "subcategory": "india-business", "source": "Times of India", "scraped_at": "2025-09-28T00:07:54.871455", "word_count": 762, "read_time": 4, "date_machine": "Updated: Sep 27, 2025, 12:11 IST", "tags": ["Donald Trump", "pharmaceutical products", "tariff announcement", "Indian generic drug makers", "US pharmaceutical market", "Sun Pharmaceuticals", "Zydus Lifesciences Limited", "Dr. Reddy's Laboratories Limited"]}
]